{
    'results': [{
        'content': {
            'attribution': [{
                'source_id': 'wikivoyage',
                'url': 'http://en.wikivoyage.org/wiki/Bangkok'
            }],
            'sections': [{
                'body': '<b><a href="http://bangkoktourist.com">Bangkok</a></b> is the capital of Thailand and, with a population of over eleven million inhabitants, by far its largest city. Its high-rise buildings, heavy traffic congestion, intense heat and naughty nightlife do not immediately give you a warm welcome — but don\'t let your first impression mislead you. It is one of Asia\'s most cosmopolitan cities with magnificent temples and palaces, authentic canals, busy markets and a vibrant nightlife that has something for everyone.\nFor years, it was only a small trading post at the banks of the Chao Phraya River, until King Rama I, the first monarch of the present Chakri dynasty, turned it into the capital of Siam in 1782, after the burning of Ayutthaya by Burmese invaders. Since then, Bangkok has turned into a national treasure house and functions as Thailand\'s spiritual, cultural, political, commercial, educational and diplomatic centre.',
                'image': {
                    'attribution': {
                        'license_link': 'http://creativecommons.org/licenses/by-sa/2.0/',
                        'attribution_link': 'http://www.flickr.com/photos/jmhullot',
                        'attribution_text': 'Jean-Marie Hullot',
                        'license_text': 'CC BY-SA 2.0',
                        'format': '{attribution} / {license}'
                    },
                    'license': 'CC BY-SA 2.0',
                    'sizes': {
                        'medium': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pDwys_XNucYd6-kqcbau6VmXzRlNhh5_7_FVBYA2QD5s1UcRUIG-McC8xbgqXgBctMIRG87GjDVBjwBv1QfTordNUR6pfkPbvIgX8LzEgbroShvVRFni1SKtn5FjheBbSETgz3g4pr4v0X0vmBbjsqZMTPD5F-3iSe63CMI6oOl0-9y3YILHtLJVv1RGJMikaWPXvNSQ7ckBddun58c8svg==',
                            'width': 640,
                            'bytes': 21489,
                            'height': 425
                        },
                        'thumbnail': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pIlupKJYJ7vRNkTkmn-z8ptreCMqdM13qNoKeDI5mRqBW7PJ0TEzFlGaGSws-DH62RnGnNTga5qFF-Tl3qKaOHcRB2tQtnGUXxt-prKb_fSvoddS3x9gn5oG-cHv4obx0YaM564drwAM9Au46V_HqQBA9Sf9qr_xz9nxdFK_4m8m7zNMWIcUHxprH4cpq43kpRg8lMveJ7kT_Vv6sjNJH8Q==',
                            'width': 192,
                            'bytes': 3826,
                            'height': 127
                        },
                        'original': {
                            'url': 'https://farm3.staticflickr.com/2153/2068022450_b6c62f89a3_o.jpg',
                            'width': 800,
                            'bytes': 138901,
                            'height': 532
                        }
                    },
                    'owner': 'Jean-Marie Hullot',
                    'source_url': 'https://farm3.staticflickr.com/2153/2068022450_b6c62f89a3_o.jpg',
                    'caption': None,
                    'source_id': 'flickr',
                    'owner_url': 'http://www.flickr.com/photos/jmhullot'
                },
                'title': ''
            }, {
                'body': 'Bangkok is a huge and modern city humming with nightlife and fervor. Administratively, it is split up into 50 districts which are further split into 154 sub-districts (แขวง <i>khwaeng</i>), but these are more often used in official business and for addresses. Visitors will find the conceptual division below of the main areas more useful for getting around.\n\nAround Bangkok are the provinces of <a data-object_type="location" data-id="Nakhon_Pathom">Nakhon Pathom</a> to the west, <a data-object_type="tag" data-location_id="Bangkok" data-id="district-nonthaburi">Nonthaburi</a> to the northwest, <a data-object_type="location" data-id="Pathum_Thani">Pathum Thani</a> to the north, <a data-object_type="location" data-id="Chachoengsao">Chachoengsao</a> to the east, Samut Prakan to the southeast and <a data-object_type="location" data-id="Samut_Sakhon">Samut Sakhon</a> to the southwest.',
                'image': {
                    'attribution': {
                        'license_link': 'http://creativecommons.org/licenses/by-sa/3.0',
                        'attribution_link': 'https://commons.wikimedia.org/wiki/File:Bangkok-central-map.png',
                        'attribution_text': 'Globe-trotter',
                        'license_text': 'CC BY-SA 3.0',
                        'format': '{attribution} / {license}'
                    },
                    'license': 'CC BY-SA 3.0',
                    'sizes': {
                        'medium': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pMVLic_WfIKs_7gSbdMFnaBGs8s34R4bsbeyHJilz-NeeoLSOO5ucNMRps-CLB46yOtR2YvAjmOg8oijDxTkrnJ-WIdwIFb-fQYZNemCOvKoPih4_nCjzeQFw9LNoRgyAOc1NZp8RhyyQKqDvbTg1PsmRe7b7eJ51vjbBTK7jhsGuWDbmVkOWPuZ9c2hOd_UHanVY6e-aNsVETWtzNuee4RT8AlgSfqN_vYgC52AE9mQ=',
                            'width': 640,
                            'bytes': 98918,
                            'height': 563
                        },
                        'thumbnail': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pi_HshqN1doyrqM2KHAup_nS4XvuJeAs7Zs-4FibfDyg3Gs3uzddgg1Dm8_Y9KGtCIdJQwSY8l5nZp0YIWFfdGof4vLK29mEAEpa13ysjNlWcxhu67FhLinQzv-zqtGqWZCoBX47BLOFaif_OUP0isfuYdbTtFw5QqU28EdFsdiMy-_020BnL_OcCQW79ZCsijRzoDm7LThftqyNINJ2Cu7ZlOKWG2A-gy9nf2dqy4A0=',
                            'width': 192,
                            'bytes': 15232,
                            'height': 168
                        },
                        'original': {
                            'url': 'https://upload.wikimedia.org/wikipedia/commons/1/17/Bangkok-central-map.png',
                            'width': 3418,
                            'bytes': 3045648,
                            'height': 3008
                        }
                    },
                    'owner': 'Globe-trotter',
                    'source_url': 'https://upload.wikimedia.org/wikipedia/commons/1/17/Bangkok-central-map.png',
                    'caption': 'Map of Central Bangkok',
                    'source_id': 'wikivoyage',
                    'owner_url': 'https://commons.wikimedia.org/wiki/File:Bangkok-central-map.png'
                },
                'title': 'Districts'
            }, {
                'body': "Just under 14 degrees north of the equator, Bangkok is a tropical metropolis that is also one of the most traveller-friendly cities in Asia. A furious assault on the senses, visitors are immediately confronted by the heat, the pollution, unpleasant smells, and the irrepressible smile worn by many Thais. Despite the sensationalised international news reports and first impressions, the city is surprisingly <b>safe</b> and more organised than it initially appears, and is full of <b>hidden gems</b> waiting to be discovered. The high relative humidity and warm temperature favour the growth of tropical plants — you'll find exotic orchids and delicious fruit everywhere. Bougainvillea and frangipani bloom practically all over the city. Thai cuisine is justifiably famous, varied, and affordable. Bangkok for many represents the quintessential Asian capital. Saffron-robed monks, garish neon signs, graceful Thai architecture, spicy dishes, colourful markets, traffic jams, and the tropical climate come together in a happy coincidence. It is difficult to leave with only lukewarm impressions of the city.\n<b>Thailand remains in mourning</b> for King Rama IX, who died on 13 Oct 2016 having reigned for 70 years. Mourning is nationwide but particularly evident in Bangkok, with drapes over public-sector buildings, and many Thais dressed in black. Several streets around the palace are closed, and the palace itself is reserved for mourning parties; however the adjacent temples remain accessible and indeed the National Museum has free admission until 31 Jan 2017. The mourning period will last at least one year, perhaps longer depending on arrangements for the late king's cremation - construction for this only starts in February 2017. Whenever his funeral is held, expect Thailand and especially Bangkok to come to a standstill.",
                'image': None,
                'title': 'Understand'
            }, {
                'body': '"Bangkok" was originally a small village on the west bank of the Chao Phraya River. After the fall of Ayutthaya in the late 18th century, King Taksin the Great turned that village into Siam\'s new capital and renamed it Thonburi. In 1782, King Rama I moved the capital to the eastern bank of the river at Rattanakosin; originally the site of a Chinese community, which was moved outside of the new city walls to Yaowarat. King Rama I named the city <i>Krung Thep</i>, as it is now known to Thais and which in English translates as the "City of Angels".\nThe full name <i>"Krung thep mahanakhon amorn ratanakosin mahintharayutthaya mahadilok popnoparat ratchathani burirom udomratchanivetmahasathan amornpiman avatarnsathit sakkathattiyavisnukarmprasit"</i> is listed as the world\'s longest location name by the Guinness Book of Records; an English rendering goes like this: "The city of angels, the great city, the residence of the <a data-object_type="poi" data-id="T__1c8049b19be1">Emerald Buddha</a>, the impregnable city of Ayutthaya of God Indra, the grand capital of the world endowed with nine precious gems, the happy city, abounding in an enormous Royal Palace that resembles the heavenly abode where reigns the reincarnated god, a city given by Indra and built by Vishnukarn". Foreigners never caught on to the change, so in foreign languages <i>Krung Thep</i> inherited the name Bangkok, which became its formal English name. For Thais, the name Bangkok refers to the former village on the west bank of the Chao Phraya, which was incorporated into Greater Bangkok in 1971.\nLife was taking place on the water; ordinary people lived on bamboo-rafts along the river, while floating vendors roamed the water to sell fruit and vegetables. The only stone structures built on land were temples and palaces. In the 19th-century, Western powers incorporated much of Southeast Asia into their colonial empires. Kings Rama IV and V felt that the only way to keep Siam independent was to modernise the country along European lines. Traditional canals were filled up and turned into roads. King Rama V moved the residence of the King to Dusit and laid out that district\'s grand boulevards along European lines.\nBangkok really started to develop after World War II. The economic centre shifted from the orderly planned city of Rattanakosin in an eastward direction, leaving Bangkok without an obvious centre. Bangkok established itself as the driving power behind Thailand\'s new role as a newly industrializing country from the 1980s on`. Rapid economic growth has attracted migration from the countryside, with millions of Thais moving here from Isaan and other regions to make a living.\nThis rapid expansion turned Bangkok into one of the most cosmopolitan and happening cities in Asia; but also ensured numerous problems. A wide gap has emerged between those who profit from economic activity, and those who came to the city from the countryside in search of work. Bangkok\'s seemingly never-ending traffic jams continue as the new Skytrain and metro systems are too expensive for the working class. Getting a break from the fumes in a park would seem to be a good idea, but unfortunately Bangkok has the lowest amount of green space of all capital cities in the world.',
                'image': {
                    'attribution': {
                        'license_link': 'http://creativecommons.org/licenses/by-sa/2.0',
                        'attribution_link': 'https://commons.wikimedia.org/wiki/File:Grand_Palace_in_Bangkok.jpg',
                        'attribution_text': 'echiner1',
                        'license_text': 'CC BY-SA 2.0',
                        'format': '{attribution} / {license}'
                    },
                    'license': 'CC BY-SA 2.0',
                    'sizes': {
                        'medium': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2p9B8sYya9iY_jNUVq0T6pB0iXeJQRxxjsW0MDSXg_S3iI408M5jBY9cl0BDOsF2DwgYgIB-GrfvUD9DqgUpEREyVVrDVmh3tp45acejynAaxAQXg9leGBj27wRwKvJd7jH-h4caBihrRAMNGC-GndTEVg9HFd-AxTUbS2Mwu58C_TsHzwiuktZJQL6im_HZi2SD3_AQAunn_LeM8vLB8Q7fJcLldlHLPJgAwhHDGI-QM=',
                            'width': 640,
                            'bytes': 54678,
                            'height': 426
                        },
                        'thumbnail': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pZxynmBTBHlljS4kKVwZvAd38EITx6K7OdXlAv6bJ0p9SLxOU3998M2gQSXCILqgRu3_oPtuo4cxZmJ8MLkkYPVIW4x07UNFpln35Mnuv0Z68Y2GiFZVIc0y7fzAbKa6uRr76bwPPo26ZMCAqWtCct-fIsle72X4xLABxRVNpdfIOsUPoL-vDFc1Yk05h67ECaGpEw_KVOvkejZXctFGPwZ80Z93W358A--XRjc8DYZo=',
                            'width': 192,
                            'bytes': 8423,
                            'height': 128
                        },
                        'original': {
                            'url': 'https://upload.wikimedia.org/wikipedia/commons/9/93/Grand_Palace_in_Bangkok.jpg',
                            'width': 1024,
                            'bytes': 497870,
                            'height': 683
                        }
                    },
                    'owner': 'echiner1',
                    'source_url': 'https://upload.wikimedia.org/wikipedia/commons/9/93/Grand_Palace_in_Bangkok.jpg',
                    'caption': 'Chakri Maha Prasat Hall, Grand Palace',
                    'source_id': 'wikivoyage',
                    'owner_url': 'https://commons.wikimedia.org/wiki/File:Grand_Palace_in_Bangkok.jpg'
                },
                'title': 'History'
            }, {
                'body': 'Addresses in Bangkok use the Thai addressing system, which may be a little confusing to the uninitiated. Large roads such as Silom or Sukhumvit are <b>thanon</b> often abbreviated <i>Th</i> or glossed "Road", while the side streets branching off from them are called <b>soi</b> (ซอย). Sois are numbered, with even numbers on one side and odd numbers on the other side. Thus, an address like "25 Sukhumvit Soi 3" means house/building number 25 on the 3rd soi of <a data-object_type="poi" data-id="Sukhumvit_Road">Sukhumvit Road</a>. While the soi numbers on each side will always advance upward, the numbers often do not advance evenly between sides — for example, Soi 55 could be across from Soi 36. Many well-known sois have an additional name, which can be used instead of the number. Sukhumvit Soi 3 is also known as "Soi Nana Nuea", so the address above might thus also be expressed as "25 Soi Nana Nuea". The extension /x is used for new streets created between existing streets, as seen in Sukhumvit\'s soi pattern 7, 7/1, 7/2, 9, 11. Note that some short alleys are called <b>trok</b> (ตรอก) instead of soi.\nTo make things a little more complex, some large sois like Soi Ekkamai (Sukhumvit Soi 63) and Soi Ari (Phahonyothin Soi 7) have their own sois. In these cases, an address like "Ari Soi 3" means "the 3rd soi off Soi Ari", and you may even spot addresses like "68/2 Ekkamai Soi 4, <a data-object_type="poi" data-id="Sukhumvit_Road">Sukhumvit Road</a>", meaning "2nd house beside house 68, in the 4th soi of Ekkamai, which is the 63rd soi of Sukhumvit". In many sois, the house numbers are not simply increasing, but may spread around.\nTo further bewilder the tourist who doesn\'t read Thai, the renderings of Thai street names in the Latin alphabet are not consistent. The road running towards <a data-object_type="poi" data-id="T__3b6f5a4fc759">Don Mueang Airport</a> from <a data-object_type="poi" data-id="W__158185227">Victory Monument</a> may be spelled <i>Phahonyothin</i> or <i>Phahon Yothin</i> or <i>Pahon Yothin</i> or <i>Phaholyothin</i> depending on which street sign or map you consult. It\'s all the same in Thai, of course, only the romanisation varies.\nAnd if that\'s not confusing enough, most of the larger streets tend to change names altogether every few kilometres. Sukhumvit is called <i>Sukhumvit</i> on one side of the tollway (roughly east), but it becomes <i>Phloen Chit</i> just before you cross Witthayu Road (aka <i>Wireless Road</i>) going towards the river. Keep going just a few more streets and it becomes <i><a data-object_type="poi" data-id="T__6baef6d7ec26">Rama I Road</a></i> (or <i>Phra Ram Neung Road</i>) <a data-object_type="poi" data-id="T__f5d50a1c60d2">after you</a> pass Ratchadamri Road. But if you were to turn right onto Ratchadamri, in just a few blocks you\'ll find yourself on <i>Ratchaprarop Road</i> (past Phetchaburi, aka <i>New Phetburi</i>, which is called <i>Phitsanulok</i> closer to the river).\nFortunately, there\'s logic to these name changes: most of them are neighbourhoods. It wouldn\'t make sense to call the road <i>Sukhumvit</i> if it\'s no longer running through the Sukhumvit area, would it? Thus, Sukhumvit becomes <i>Phloen Chit</i> where it runs though the Phloen Chit area. It\'s when you\'re able to grasp the city in terms of its neighbourhoods that it both becomes more navigable and more charming. Likewise, Pratunam and Chatuchak are much more than just markets; they\'re neighbourhoods, each with their own distinct character.\nCompass directions are not widely used by Thais to navigate in Bangkok. Thus, asking for directions in terms of "Is that west from here?" will probably earn you little more than a confused look from a local. You\'re better off to familiarise yourself with the neighbourhoods and navigate to and from them. "How do I get to <a data-object_type="poi" data-id="Thong_Lo">Thong Lo</a>?" will get you there faster than asking for directions to <i>Sukhumvit Soi 55</i>.\nOne exception: the Chao Phraya River is the landmark in Bangkok, and many directional references can be made as "toward the river" or "away from the river". If you aren\'t too close, that is: since the river winds around the most popular tourist areas, river references tend to be most helpful when you\'re wandering farther afield than Khao San Road, <a data-object_type="poi" data-id="W__23630232">Sanam Luang</a> or Rattanakosin. And wander you should.',
                'image': {
                    'attribution': {
                        'license_link': 'http://creativecommons.org/licenses/by/2.0',
                        'attribution_link': 'https://commons.wikimedia.org/wiki/File:BTS_Thong_Lo_Station.jpg',
                        'attribution_text': 'Andy & Anna Kelk',
                        'license_text': 'CC BY 2.0',
                        'format': '{attribution} / {license}'
                    },
                    'license': 'CC BY 2.0',
                    'sizes': {
                        'medium': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pGKlT-9w05VCxwGrBv7TUNKa3Sl05Zss2wGroz_IFcrzeiRzNZzS64SVtsa2ppY6dXw8GjcccBQIcVBbtz-Ogd2EdaehsSkdkym9iWKpgxky-iu_I6W9_yTnb8kMoaEpzxVj6lj6KlxsYtCi0LsRxJRfqQgY1dzfbt__Baxl8_3fXavDkGTFXiNRTAfa06fnq49lkVXh9KYHeWZcjBcENcxRiwTtKyeNtxyihu53iXvs=',
                            'width': 640,
                            'bytes': 44728,
                            'height': 483
                        },
                        'thumbnail': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2p1k5Wou7x7WmP_xCdjisILMbPtSKyaH9_qlhBoou-RA3dR_rL5dHwJPRE6-nbVoJsKYM3Kk8iqOur4UyXHb83YmHTFJLjYBbDtosu0i1R0858JIOWXYanReGpGH5F2iRgmZS5DfFk4fZn2DB7Odo1VQrUzy7lpNL5wX4V4YIvqLVtD55K9bRyqULbGH3Ximb7Kpe24NWFnJl-W5WUFLuUeg3QdvgGMYg04e-qdIIIPVI=',
                            'width': 192,
                            'bytes': 7465,
                            'height': 144
                        },
                        'original': {
                            'url': 'https://upload.wikimedia.org/wikipedia/commons/f/f1/BTS_Thong_Lo_Station.jpg',
                            'width': 1632,
                            'bytes': 807058,
                            'height': 1232
                        }
                    },
                    'owner': 'Andy & Anna Kelk',
                    'source_url': 'https://upload.wikimedia.org/wikipedia/commons/f/f1/BTS_Thong_Lo_Station.jpg',
                    'caption': 'Skytrain of Bangkok near Thong Lo station',
                    'source_id': 'wikivoyage',
                    'owner_url': 'https://commons.wikimedia.org/wiki/File:BTS_Thong_Lo_Station.jpg'
                },
                'title': 'Addresses and navigation'
            }, {
                'body': 'According to the World Meteorological Organization, Bangkok is the world\'s hottest city. Just 14 degrees north of the equator, Bangkok is sunny at all times of the year with temperatures over 30°C .\nThe most pleasant time to visit is the <b>cool season</b> that lasts from Nov-Feb. It is both the coolest and driest period — the <a data-object_type="poi" data-id="T__1c8049b19be1">Emerald Buddha</a> statue in Wat Phra
Kaeo even wears a scarf during this period! Don\'t think that\'s necessary though — daytime temperatures still hover around 30°C (86°F), but it does cool down into the lower 20s as it gets dark (lower 70s in Fahrenheit). March and April represent the <b>hot season</b>, and hot it is — 35°C (95°F) on average, but don\'t be surprised to see heat indices rising into the 50s °C (around 120 °F+). This is the worst season to visit Bangkok, so plan in a lot of air-conditioned shopping mall visits and get a hotel with a swimming pool. Then there\'s the <b>wet season</b> that runs from May-Oct. Expect massive downpours resulting in floods all over the city, and spells of thunder at times. It\'s not all bad though — the afternoon showers are actually a pleasant way to cool down from the heat, and while they may last all day, usually they\'re over within an hour. Extreme rainfall happens in September and October, so these months are best avoided.\nWhatever season you\'re visiting, don\'t take the weather lightly — temple-tramping in the scorching afternoon sun can be a challenge, so come well-prepared. <b>Dress lightly</b> for the weather, but keep in mind that <b>some palaces and temples</b> (notably the Grand Palace) <b>have a strict dress code</b>, i.e., everyone must fully cover their torso, legs and upper arms. So shorts, halter tops, etc. will deny you entry. At entrances to some major attractions, vendors may rent needed coverage.\nAlso be sure you <b>drink enough fluids</b>! You have no excuse not to, as 7-Elevens and other convenience stores are abundant in Bangkok and sell cooled beverages for as little as 10 baht. Locals get their water from "reverse osmosis" purified water machines that fill up a one litre bottle for 1 baht, but the potability for visitors may vary.',
                'image': None,
                'title': 'Climate'
            }, {
                'body': 'Foreign films were popular in Thailand from the get-go, but in the 1920s a local film industry started to emerge in Bangkok. The most critically acclaimed Thai films were produced in the "three waves" of the Thai film industry, the 1930s, the 1950s and the late 1990s/early 2000s, although films made before World War II have unfortunately been lost. Predominant genres are action, historical epics, romance and gay/transgender films, almost always intertwined with elements of comedy. The following are staged in Bangkok:\n\n<ul>\n<li> <i>6ixtynin9</i> (เรื่องตลก 69, Pen-ek Ratanaruang, 1999). Tum, a secretary just fired from a financial corporation during the Asian financial crisis, discovers an instant noodle box in front of her door. It is filled with mone
y and she decides to keep it. However, the people that left it there soon want it back.</li>\n</ul>\n<ul>\n<li> <i>Bangkok Dangerous</i> (บางกอกแดนเจอรัส เพชฌฆาตเงียบ อันตราย, The Pang Brothers, 1999). The debut of the Pang Brothers,<i>Bangkok Dangerous</i> is a stylish film about a hitman who finds love, and realises how his actions are hurting good people.</li>\n</ul>\n<ul>\n<li> <i>The Beach</i> (Danny Boyle, 2000). Richard (pla
yed by Leonardo DiCaprio) is a young American backpacker looking for adventure. In Khao San Road, he meets Daffy, who makes him believe a beach paradise exists on a secret island. It is a popular film in the backpacker community. Besides Bangkok, some scenes in this Hollywood production are filmed in <a data-object_type="location" data-id="Phi_Phi_Islands">Ko Phi Phi</a>, a beach island in the south of Thailand.</li>\n</ul>\n<ul>\n<li> <i>Citizen Dog</i> (หมานคร, Wisit Sasanatieng, 2004). An eccentric, bright, colour-splashed film that follows the life of Pod as he moves to Bangkok from the countryside. Without a goal in life, Pod falls in love with Jin, a girl who lives for her dreams. It gives a playfully ironic portrait of Bangkok, the city that offers false dreams and real disillusionment.</li>\n</ul>\n<ul>\n<li> <i>The Hangover Part II</i> (Todd Phillips, 2011). American comedy film about a group of friends (the "wolf pack") who travel to Bangkok for a bachelor party. A lot of stereotypes are confirmed, but it is still a good laugh. Most scenes of the film are shot in Yaowarat, Sukhumvit and Thonburi. <a data-object_type="poi" data-id="T__4b6cc66c42ce">The State</a> Tower in Silom is also featured.</li>\n</ul>\n<ul>\n<li> <i>Iron Ladies</i> (สตรีเหล็ก, Youngyooth Thongkonthun, 20
00). This film follows the true story of a men\'s volleyball team that almost entirely consists of gay and transgender players. The team competes for the 1996 national championships, and while the crowd loves them, they are being judged by other teams and match officials.</li>\n</ul>\n<ul>\n<li> <i>Ong-Bak: <a data-object_type="poi" data-id="T__9acf96d2be7e">Muay Thai</a> Warrior</i> (องค์บาก, Prachya Pinkaew, 2003). Martial-arts s
tar Tony Jaa\'s breakthrough film and an absolute must-see for those interested in <a data-object_type="poi" data-id="T__9acf96d2be7e">Muay Thai</a> or fight choreography. Many places in Bangkok are featured, but don\'t think Khao San Road is the underground fighting den as it is portrayed.\n</li>\n</ul>',
                'image': None,
                'title': 'Films'
            }, {
                'body': 'Most of Bangkok\'s sights are concentrated on the island of Rattanakosin, often referred to as the "Old City". Out of Bangkok\'s hundreds of temples, the <b><a data-object_type="poi" data-id="W__23482754">Grand Palace</a></b>, <b><a data-object_type="poi" data-id="N__255984012">Wat Pho</a></b> and <b><a data-object_type="poi" data-id="N__254297780">Wat Arun</a></b> usually make up the top 3. The <a data-object_type="poi" data-id="W__23482754">Grand Palace</a> has an immense size, so expect to spend at least a full morning or afternoon there. Within the palace grounds is <b>Wat Phra Kaeo</b>, the most sacred Buddhist temple of Thailand. Unlike other temples, it is not one building, nor are there living spaces for monks. Instead, it is a collection of highly decorated holy buildings and monuments. One of its buildings houses the <b><a data-object_type="poi" data-id="T__1c8049b19be1">Emerald Buddha</a></b>, and while you might not expect it from its size, it is the most sacred Buddha image of Thailand.\nNearby is <b><a data-object_type="poi" data-id="N__255984012">Wat Pho</a></b>, home to the world\'s largest reclining Buddha image and a famed massage school. Take the ferry across the Chao Phraya River to Thonburi for the outstanding <b><a data-object_type="poi" data-id="N__254297780">Wat Arun</a></b>. The main structure is about 60 to 88 m high and it is surrounded by four smaller prangs. It is one of Thailand\'s most picturesque temples, and is engraved on the inner part of all ten baht coins. It is so recognisable that it even became the logo of the Tourism Authority of Thailand . If you climb it, and look closely, you will see that it is beautifully decorated with colourful broken Chinese porcelain pieces. Heading back to Rattanakosin, there are many other major temples you could visit, including the <b>Golden Mount</b>, <b><a data-object_type="poi" data-id="W__32011053">Wat Suthat</a></b> and <b>Wat Ratchanaddaram</b>.\nDon\'t throw away the entry ticket of the <a data-object_type="poi" data-id="W__23482754">Grand Palace</a>, as it gives free entry to the <b><a data-object_type="poi" data-id="W__25743500">Dusit Palace</a></b> in Dusit. It is situated in a leafy, European-style area built by King Rama V to escape the
heat of the <a data-object_type="poi" data-id="W__23482754">Grand Palace</a>. Its main structure is the <b><a data-object_type="poi" data-id="W__31987914">Vimanmek Mansion</a></b>, touted as the largest golden teakwood house in the world, but you could spend your whole day in the museums if you wish. There are many museums in Bangkok showing traditional Thai-style residences. Many visitors take a tour through <b><a data-object_type="poi" data-id="T__9f7d30d9a9fd">Jim Thompson</a>\'s House</b>, the CIA-operative\'s mansion assembled by combining six traditional Thai-style houses, conveniently located near Siam Square. <b>Ban Kamthieng</b> in Sukhumvit, <b>M.R. Kukrit\'s Heritage Home</b> in Silom and the <b><a data-object_type="poi" data-id="Suan_Pakkad_Palace">Suan Pakkad Palace</a></b> in Phahonyothin are not quite as impressive, but still make for a nice experience. Rattanakosin\'s museums are mostly dedicated to history and culture, including the <b>National Museum</b> (about Thai history and archaeological remains), the <b>Museum of Siam</b>, <b> Rattanakosin Museum</b> (which offers two guided tours with interactive displays regarding the history of old and modern Thai life), and the <b><a data-object_type="poi" data-id="King_Prajadhipok_Museum">King Prajadhipok Museum</a></b>. Bangkok has a small, but vocal art community, and you might want to visit the <b><a data-object_type="poi" data-id="N__256148579">National Gallery</a></b> or <b><a data-object_type="poi" data-id="wtl__39ad0325">The Queen\'s Gallery</a></b>, or one of the numerous smaller galleries spread over the city. Siam Square features the <b><a data-object_type="poi" data-id="W__48966995">Bangkok Art and Culture Centre</a></b> which has temporary art exhibitions throughout the year.\n<b><a data-object_type="poi" data-id="W__23483299">Lumphini Park</a></b> in Silom is the largest park in central Bangkok, and a good way to escape the fumes. Backpackers around Khao San Road can head for <b>Santichaiprakarn Park</b>, a small but fun park along the Chao Phraya River with a breezy atmosphere, usually with locals juggling or practicing tricks. It is built around the 18th-century <b><a data-object_type="poi" data-id="wtl__421f4635">Phra Sumen Fort</a></b> with a nice view on the modern Rama VIII cable-stayed bridge. Zoos and animal farms are some of the more popular tourist attractions in Bangkok, but before visiting, please be aware that animal welfare in Thailand is not strictly regulated. Poor living conditions of the animals and inadequate veterinary care are examples of the sad mistreatment of the animal population. You can\'t go wrong at the <b>Queen Saovabha Institute Snake Farm</b> in Silom, as the staff takes good care of their snakes and they have a job of informing the public about the risks associated with them. Another nice family attraction is <b><a data-object_type="poi" data-id="N__1696984984">Siam Ocean World</a></b> in Siam Square. It has a steep price tag, but at least you get to see the largest aquarium in Southeast Asia.',
                'image': None,
                'title': 'See'
            }, {
                'body': "<ul>\n<li> One day in Bangkok — if you have just one day to spare and want to catch a feel for the city</li>\n</ul>\n<ul>\n<li> Rattanakosin Tour — a quick tour along Bangkok's famed historic district</li>\n</ul>\n<ul>\n<li> Yaowarat and Phahurat Tour — a full-day walking tour through this multicultural district\n</li>\n</ul>",
                'image': None,
                'title': 'Itineraries'
            }, {
                'body': '',
                'image': None,
                'title': 'Do'
            }, {
                'body': 'All of Thailand\'s major festivals are celebrated in Bangkok. <b>New Year</b> is celebrated three times. There\'s the new year following the Gregorian calendar at January 1, celebrated with a huge fireworks display at Ratchaprasong intersection. Then there\'s <b>Chinese New Year</b> in January or February, with grandiose and colourful Chinese lion and dragon processions in Yaowarat. Finally, the water festivities of <b>Songkran</b> celebrate the traditional Thai New Year in the middle of April. Khao San Road degenerates into a war zone as <i>farangs</i> and locals duke it out with super soakers. More respectable celebrations are held at <a data-object_type="poi" data-id="W__23630232">Sanam Luang</a>, where the revered Phra Phuttha Sihing image is displayed and bathed by devotees, and at the Wisut Kasat intersection, where a Miss Songkran beauty contest is held and accompanied by merit-making and entertainment.\nDuring the <b>Royal Ploughing Ceremony</b> in May, farmers believe that an ancient Brahman ritual, conducted at <a data-object_type="poi" data-id="W__23630232">Sanam Luang</a>, is able to forecast whether the coming growing season will be bountiful or not. The event dates back to the Sukhothai Kingdom and was re-introduced in 1960 by
King Bhumibol Adulyadej. It is considered the official commencement of the rice-growing season . Nowadays, the ceremony is conducted by Crown Prince Maha Vajiralongkorn. <b>Loi Krathong</b> (ลอยกระทง), the Festival of Lights, usually takes place in November. <i>Krathongs</i> are floating rafts made from lotus flowers and banana leaves with a lighted candle and incense on top. On the night of the full moon, Thais send their <i>krathong</i> down a river, canal or pond, and the owner\'s bad luck carries away along with it insuring a fresh start. Celebrations take place all over town with parades, concerts and beauty pageants. Loi Krathong coincides with the Lanna festival <b>Yi Peng</b> (ยี่เป็ง). At this festival, a multitude of Lanna-style paper lanterns are launched into the air. <a data-object_type="poi" data-id="W__23483299">Lumphini Park</a> is the best p
lace to launch a krathong down the pond or to launch a paper lantern into the sky.\nThe <b>Trooping of the Colours</b> in early December is an impressive annual event, held in the <a data-object_type="poi" data-id="Royal_Plaza_28Thailand29">Royal Plaza</a> near the equestrian statue of King Rama V in Dusit. Dressed in colourful uniforms, amid much pomp and ceremony, members of the elite Royal Guards swear allegiance to the King and march past members of the Royal Family. December 5 is <b>Father\'s Day</b>, the King\'s birthday, and Ratchadamri Road and the <a data-object_type="poi" data-id="W__23482754">Grand Palace</a> are elaborately decorated and illuminated. In the evening, hundreds of thousands of locals line the route from <a data-object_type="poi" data-id="W__23630232">Sanam Luang</a> to the Chitralada Palace to get a glimpse of the King when he is slowly chauffeur-driven past.',
                'image': {
                    'attribution': {
                        'license_link': 'http://creativecommons.org/licenses/by/2.0/at/deed.en',
                        'attribution_link': 'https://commons.wikimedia.org/wiki/File:Loy_Krathong_Bangkok_Lumpini_Park_2.jpg',
                        'attribution_text': 'Robertpollai',
                        'license_text': 'CC BY 2.0 at',
                        'format': '{attribution} / {license}'
                    },
                    'license': 'CC BY 2.0 at',
                    'sizes': {
                        'medium': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pl-IRRJEe2aWvqsw0Pznuxjz1OyRe3r6BpLlMfkPiNoKxUJa1snbYoyJuH2dd9db2E6Nb-IV0hbV4rCbBH2Le6QY28nUWsGQdq3BgUcdMNSUH18by2IcUGKeBOlgYoJpctAFnkQ77C6b7xFZpEyHUnTjymMWWEmdFR6nZwBEBSt0AE8mD4OLaU3Bi0oa5uo7Yff7dsDDNGO9SV3FoMyH7wXA88t-G32YbmlAFj2bjaPw=',
                            'width': 640,
                            'bytes': 10207,
                            'height': 426
                        },
                        'thumbnail': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pmHcXbQFkczllOArk6QC_v18DYcOj3cUbes65vgDaqUJuHKoYy8Ce8zhkpNxvfwxcdYC0WHEWg_xX36qKEDl6nCrXEmKECBT4AXzGujk8_YJHEiQZjI9zdHDkfw_ZLXFh5Jr1UyzqeYYR2EuH7yR2s17l2YygQ0TvADa29GaCES2A7RfSKXPwQlViWTv6_6Of-7oh18be5JW-haH6AVThx7iTDD3bwaPwp-9gF_SjgrA=',
                            'width': 192,
                            'bytes': 2557,
                            'height': 128
                        },
                        'original': {
                            'url': 'https://upload.wikimedia.org/wikipedia/commons/1/14/Loy_Krathong_Bangkok_Lumpini_Park_2.jpg',
                            'width': 3504,
                            'bytes': 1277517,
                            'height': 2336
                        }
                    },
                    'owner': 'Robertpollai',
                    'source_url': 'https://upload.wikimedia.org/wikipedia/commons/1/14/Loy_Krathong_Bangkok_Lumpini_Park_2.jpg',
                    'caption': 'Launching a krathong down a pond',
                    'source_id': 'wikivoyage',
                    'owner_url': 'https://commons.wikimedia.org/wiki/File:Loy_Krathong_Bangkok_Lumpini_Park_2.jpg'
                },
                'title': 'Festivals'
            }, {
                'body': 'Until the late 19th century, Bangkok was known as "Venice of the East". Most people lived near or on the water and an intricate network of canals was the primary mode of transport for the city\'s inhabitants. Most canals have since been paved over, but plenty of them remain and some still function as transport routes as of this day. The traditional canal-side way of life has almost vanished, but as Thonburi was largely undeveloped until the 20th century, there is still some authenticity to be found. Floating markets had completely disappeared by the 20th century, but have been reinstated for tourism purposes and are a fun visit.\nYou can see the Chao Phraya River and the backwaters of the city by <b>canal tour</b>. Most of these boat trips start at the eastern bank of the Chao Phraya and then ply through the backwaters of Thonburi taking in <a data-object_type="poi" data-id="N__254297780">Wat Arun</a>, the Royal Barges National Museum, a floating market and some other minor attractions. More information about these canal tours can be found in the Thonburi article. At 1,000 baht or more, they are quite expensive. You can also negotiate a price with individual boat drivers. Damnoen Saduak is a floating market that often appears in tourist brochures of Bangkok, but in practice it is 109km west of Bangkok and has to be visited by bus from the Southern Bus Terminal.\nProbably just as fun is to take the public <b>express boat</b> along the Chao Phraya River. You can get off anywhere between the Thewet and Sathorn (Taksin) piers as there are many things to see in all of these neighbourhoods. You can even take the express boat all the way north to <a data-object_type="tag" data-location_id="Bangkok" data-id="district-nonthaburi">Nonthaburi</a> in the morning, enjoy the afternoon in this laid-back traditional urban town, and take the boat back around rush hour. Another option is to get on one of the free <b>hotel shuttle boats</b> at Sathorn (Taksin) pier and have a bite at one of the associated cafés. In the evenings, Asiatique has a free shuttle boat from Sathorn (Taksin) pier to the new shopping centre downriver. A good place to see beautiful sunsets over the river.',
                'image': None,
                'title': 'Canals'
            }, {
                'body': '<b>Spas</b>, traditionally, were towns where public baths, hospitals or hotels were built on top of mineral springs so that people could come and make use of the healing properties found in the water and its mud for medical purposes. These days, a spa doesn\'t have to be a town built on natural thermal springs. It can be a place anywhere that anyone can go to, to relax in tranquil surroundings with a variety of treatment administered to recontour and rejuvenate the body and mind.\nSpas were unheard of until the 1990s, but now Bangkok is one of the highest ranking spa destinations in the world with an amazing array of treatments. All self-respecting luxury hotels in Bangkok have a spa that at least offers a traditional Thai massage. Prices are exorbitant, but they offer some of the best treatments in the city. Well-regarded spas at exceptionally high rates are given at the splurge hotels in Silom; particularly the spa at the Dusit Thani
Hotel stands out. Independent spas offer much the same experience, but offer much more competitive rates. Figure around 1,000 baht/hr for most treatments.\nThe ubiquitous little <b>massage shops</b> found on every street corner in town offer the best value for money, but the smallest range of services, with offerings usually limited to massage only. Particularly Khao San Road and Sukhumvit have plenty of these popular places. It is fairly easy to distinguish legitimate massage shops from more dubious places ; the real deal will charge 250-400 baht for a typical two-hour massage and will often have a row of beefy farmers\' daughters in white coats working on customers\' feet in public view, while the other kind has wispy girls in evening dresses wearing too much make-up and saying "hello handsome" to every passing male.',
                'image': {
                    'attribution': {
                        'license_link': 'http://creativecommons.org/licenses/by/3.0',
                        'attribution_link': 'https://commons.wikimedia.org/wiki/File:Thaimassage.jpg',
                        'attribution_text': 'Bhattharasinthorn Kosawan & Chot-Anan Kittiraweechot',
                        'license_text': 'CC BY 3.0',
                        'format': '{attribution} / {license}'
                    },
                    'license': 'CC BY 3.0',
                    'sizes': {
                        'medium': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pqxCpTDdDyJhlmwt4UiCzxABI1ygDUgyF6XhrY-Lo80NKlh1zieqT1PfwiInXpGOhFL45D28_huLsx8ka5iWAwnpqLuU6LU0SFfgGnPn7wkLYp_RdLmSesnjB6UIPlhXus4l3YDYCM0HL5YyZB73JKRWlz4lWjgSsnIL1VMTzlgi738LSQxBNNka9RnEOZPZZqWCwRTBqNASrlChlS7AFBipAAP87425t8sIoUeyqdeQ=',
                            'width': 600,
                            'bytes': 41185,
                            'height': 450
                        },
                        'thumbnail': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pbpgBVuIWcZ5yPyxmc8qYv-viy1lnrkUVJnkkiMW7XFLlPdWvaC9Oc14yC06-FI8nmdU12qFBkTcTKaHhXO3UEsF1cwwJpZ4Igy1iBNhyB76v5a0U2qKyXsu3BFGY-FbbO6FOonREwBufU_nNe64AkJBPiyhpg6jU6ZztCD0S7cSLuGPqHklRjA74_p3xK3D8BVvMyR3X401Us95-pPD42KwM1HFIMNiGGzORjcAY694=',
                            'width': 192,
                            'bytes': 8196,
                            'height': 144
                        },
                        'original': {
                            'url': 'https://upload.wikimedia.org/wikipedia/commons/0/0c/Thaimassage.jpg',
                            'width': 600,
                            'bytes': 113625,
                            'height': 450
                        }
                    },
                    'owner': 'Bhattharasinthorn Kosawan & Chot-Anan Kittiraweechot',
                    'source_url': 'https://upload.wikimedia.org/wikipedia/commons/0/0c/Thaimassage.jpg',
                    'caption': 'Thai massage in Bangkok',
                    'source_id': 'wikivoyage',
                    'owner_url': 'https://commons.wikimedia.org/wiki/File:Thaimassage.jpg'
                },
                'title': 'Pampering'
            }, {
                'body': '<a data-object_type="poi" data-id="T__9acf96d2be7e">Muay Thai</a> is both a combat sport and a means of self-defence. Contestants are allowed to use almost any part of the body for fighting: feet, elbows, legs, knees and shoulders. There are two venues in Bangkok to see this sport in action: <b><a data-object_type="poi" data-id="T__4065850b0772">Lumpinee Boxing Stadium</a></b> in Silom and <b>Ratchadamnoen Stadium</b> in Rattanakosin. Sessions can take the whole evening and it\'s not that bad if you come in slightly late as the more interesting fights tend to happen at the end. The playing of traditional music during the bouts is enjoyable as well. A downer is the steep 1,000-2,000 baht entry fee for foreigners. Thais chip in for 100 baht or less.\nIf you want to see <a data-object_type="poi" data-id="T__9acf96d2be7e">Muay Thai</a> for free, go to the <b>MBK Fight Night</b> outside <a data-object_type="poi" data-id="W__157487610">MBK Center</a> near Siam Square. Fights take place every Wednesday evening . Another option is to walk to the end of Soi Rambuttri into an alley known as Trok Kasap (near Khao San Road). Foreigners are getting classes in <a data-object_type="poi" data-id="T__9acf96d2be7e">Muay Thai</a> out in the open there, and many tourists generally sit on a bench in front of it to look at the action. Besides looking, this is an excellent place to do some <a data-object_type="poi" data-id="T__9acf96d2be7e">Muay Thai</a> yourself.',
                'image': None,
                'title': 'Muay Thai'
            }, {
                'body': 'Bicycles can be rented for free in Rattanakosin, but cyclists are officially not allowed to leave the set route along the island. Even when following the route, it\'s still not for the faint of heart.\nIf renting your own bicycle, avoid the main roads and cycle through the vast system of small streets and alleys. You can cycle through the backstreets of Yaowarat, but you might want to think twice before making a turn. You can also experience life in Bangkok\'s countryside by cycling through green paddy fields, orchid farms and lotus fields. <i>Bang Kachao</i>, in brochures often referred to as the "Bangkok Jungle", is Bangkok\'s last green frontier. It\'s a semi-island across the river from Bangkok with few cars and buildings, and a great destination for cycling.\nCyclists are treated as pedestrians, so you can use your bicycle to explore parks, temple complexes, markets and the more quiet residential areas in eastern Bangkok. In more crowded places you can cycle on the pavement. Exploring by bicycle has all the advantages of going by foot, combined with a much greater travel radius and a cooling breeze. Cycling is the best way to discover the city up close, but as there are safety issues involved, you need some insider knowledge on where to cycle. Because of this, many opt for a bicycle tour organised by an operator.\n\n<ul>\n<li> <strong>Bangkok Biking</strong>, Baan Sri Kung 350/123, Soi 71, Rama III Rd, +66 2-285 3955. Bicycle tours in small groups to and through unseen parts of Bangkok. Mostly free of traffic. A fun excursion for the whole family. 950-2,400 baht.</li>\n</ul>\n<ul>\n<li> <strong>Co van Kessel</strong>, +66 2 639-7351. Many cycling tours through Bangkok, taking in Chinatown, the canals of Thonburi, the "Bangkok Jungle" and many other places in between. 950-1,950 baht.</li>\n</ul>\n<ul>\n<li> <strong>Follow Me Bicycle Tours</strong>, 126 Sathorn Tai Rd, +66 2 286-5891. Half-day bicycle tours through Bangkok\'s residential streets. Included in the price is a fish spa and a barbecue meal after the tour. 1,000 baht.</li>\n</ul>\n<ul>\n<li> <strong>Grasshopper Adventures</strong>, 57 Ratchadamnoen Klang Rd (<em>near the <a data-object_type="poi" data-id="N__340042126">Democracy Monument</a>, right around the corner from Khao San Rd</em>, +66 2 280-0832. Tours through the historic Rattanakosin district of Bangkok, to the outskirts of Bangkok and one that takes place at night. 1,000-1,600 baht.</li>\n</ul>\n<ul>\n<li> <strong>SpiceRoads</strong>, 45 Soi Pannee, Pridi Banomyong Soi 26, Sukhumvit Soi 71, +66 2 381-7490. Many one and multi-day cycling trips in and around Bangkok. There are trips to the Bangkok Jungle, <a data-object_type="poi" data-id="T__7f3886725f74">Ko Kret</a>, Yaowarat, and Thonburi. 2,950 baht.</li>\n</ul>\n<ul>\n<li> <strong>Go Bangkok Tours</strong>, 51 Charoen Krung, Soi 44, <a data-object_type="poi" data-id="Bang_Rak_District">Bang Rak</a> (<em>BTS Saphan Taksin exit 1, 3 min walk</em>, +66 2-630 7563. Bicycle tours, some of which are GPS-guided, and bicycle rentals. Small groups, max 6. Safe and fun. 350-1,500 baht.\n</li>\n</ul>',
                'image': None,
                'title': 'Cycling'
            }, {
                'body': 'There are many theatre performances in Bangkok that depict traditional Thai culture and dance. <b><a data-object_type="poi" data-id="T__d74aea213d3f">Siam Niramit</a></b> in Ratchadaphisek is a spectacular performance as more than 150 performers depict the historical and spiritual heritage of each region of Thailand. The first act depicts Siam as a crossroads of civilisations throughout history, the second act is about the role of karma in Thai culture, and the third act focuses on religion and the role of merit-making in Thai society.\nThe <b>Aksra Theatre</b> in the <a data-object_type="poi" data-id="T__4a59de9a535d">King Power</a> Complex Building in Pratunam holds spectacular shows that are a combination of Thai traditional puppet shows, orchestral performances and classical dances. The <b>Joe Louis Theatre</b> in the Asiatique is completely dedicated to the art of operating Hun Lakhon Lek puppets. One segment has the puppets interact with audience members, which is a fun activity with children. Both Aksra and Joe Louis feature stories taken from the Ramayana epic.\nOf a completely different nature are Bangkok\'s famous transvestite shows. These cabarets generally take about two hours, and besides singing,
dancing, glamour and costumes, there\'s also has some comedy thrown in. The most famous of these is the <b><a data-object_type="poi" data-id="T__6ba9496a380f">Calypso Cabaret</a></b> at Ratchathewi intersection with two sessions every evening at the Asia Hotel. An alternative is <b>Mambo Cabaret</b>, once in Sukhumvit but now at a new location far off the tourist path in Yan Nawa. Three shows are given each evening. Always book these shows a couple of days in advance as they are almost guaranteed to be sold out if you just show up.',
                'image': None,
                'title': 'Theatre'
            }, {
                'body': 'Bangkok is a great place to go to the <b>cinema</b>. Compared to Western countries, the cost of a ticket is a complete bargain at around 120 baht. Most cinemas have world-class standards and show the latest Hollywood and Thai releases. They are up to par with the latest technological innovations in the film industry, so expect to wear 3D glasses for some of the latest Hollywood releases. You can also visit the IMAX Theatre in <a data-object_type="poi" data-id="W__157480124">Siam Paragon</a>. Thai films can be seen by foreigners as they are usually shown with English subtitles. For non-mainstream cinema, House RCA and APEX (in Siam Square) offer art films with English subtitles.\nFor other means of entertainment, Ratchadaphisek is a newly created entertainment paradise. Its <b>bowling centres</b> are of a superb standard with some of them resembling the interior of a nightclub. Dance while you play in style. Private karaoke lounges are usually connected to these bowling centres and are available at major hotels. There\'s even an ice skating rink and a top-class go-kart track in this district. As Ratchadaphisek is mostly aimed at locals,
you might want to go to similar venues in Siam Square or Sukhumvit. <b>Horse races</b> are held on Sundays at two alternate turf clubs: the Royal Turf Club of Thailand in Dusit and the Royal Bangkok Sports Club on Henri Dunant Road near Siam Square.',
                'image': None,
                'title': 'Entertainment'
            }, {
                'body': 'Bangkok is a good place for aerobics dancing. Many places in Bangkok, for example, supermarkets or public parks, offer outdoor aerobics class without any cost. These classes usually start in the morning at 06:00 or in the evening at 18:00, and the session would last long for one hour. The instructor doesn’t provide any equipment or supply, so participants should bring appropriate clothes or equipment themselves. The venue usually consisted of only empty ground and a stage for instructors. These classes don’t require Thai language skill because instructor rarely uses any verbal cues. Aside from exercising you would also meet the community of local people and foreigner. Aerobics classes usually accumulate 50-100 people.\nFor supermarkets, you can expect to find classes in Tesco Lotus or Big C. They only have classes in the evening, and are usually held in or nearby the parking areas.\nFor public parks, there are many places but the most famous one is in the Lumphini park in <a data-object_type="tag" data-location_id="Bangkok" data-id="district-silom">Silom</a> district. They have classes in the morning and in the evening at the ceremonial gate.',
                'image': None,
                'title': 'Aerobics dance'
            }, {
                'body': 'Dump a teenager in Siam Square with a few thousand baht and she\'ll stay occupied for the rest of the week! Siam Square is <i>the</i> place to shop in Bangkok; the small sois of Siam Square have dozens of small designer
boutiques. <b><a data-object_type="poi" data-id="W__157487610">MBK Center</a></b> and <b><a data-object_type="poi" data-id="W__25701334">Siam Center</a></b> are the most popular shopping malls, as they sell fashion well below Western rates. <b><a data-object_type="poi" data-id="W__157480124">Siam Paragon</a></b> and the shopping plazas at Ratchaprasong feel even larger, but are much quieter, as most local Thais cannot afford the Guccis and Louis Vuittons on sale there. Ladies will also feel well at home in the <b>Emporium</b> in Sukhumvit.\nJust take a few steps out of your hotel and Bangkok feels like a huge street market. Sukhumvit has the usual souvenirs, T-shirts and other tacky tourist junk. Browsing Khao San Road\'s roadside stalls is particularly good for clothing and accessories, many of them for a bargain. While many of these stalls still cater to the traditional hippie crowd, they have been slowly gentrifying to appeal a broader audience. The nearby <b>Banglamphu Market</b> sells cheap knock-offs of everything, just like the night markets in Silom and Rattanakosin.\nIn the weekends, the <b><a data-object_type="poi" data-id="T__918ab8a9c976">Chatuchak Weekend Market</a></b> in Phahonyothin is a must as its 8,000 stalls together form the largest market in Southeast Asia. Shoppers can buy just about everything from clothing to potted plants and everything in between — it is a paradise for browsers and bargain-hunters alike. A weekday alternative is Pratunam, one of the city\'s renowned garment markets. Clothes shopping here goes on wholesale, and you\'re even cheaper off if you buy in bulk. At <b><a data-object_type="poi" data-id="W__31141565">Pantip Plaza</a></b> you can buy computer-related stuff from
branded laptops to pirated DVDs.\nYaowarat and Phahurat give a more authentic experience, although many stores sell the cheap teen accessories found elsewhere as well. Just sitting at a plastic chair and watching daily commerce evolve is a fun activity in itself. Phahurat is the best destination for fabrics, available in all colours and sizes. <b><a data-object_type="poi" data-id="Pak_Khlong_Talat">Pak Khlong Talat</a></b> is a surprisingly fun wholesale market for cut flowers and vegetables. If you\'re a morning person, visit it around 03:00, when new flowers from upcountry arrive and the marketplace is beautifully illuminated.\nThonburi, being one of the least developed areas of Bangkok, is the best place to experience what the city used to be like. A must is the weekends-only <b><a data-object_type="poi" data-id="T__9f58bbb3aada">Taling Chan Floating Market</a></b>, which feels at least somewhat authentic as it blends a rural market with the canal side way of life. <b><a data-object_type="poi" data-id="T__0ead8141de25">Wang Lang Market</a></b> is an undiscovered gem with strictly local prices. The other side of the river, Rattanakosin, has everything a good Buddhist would need, be it amulets, monk bowls or human-sized Buddha statues.\nFor antiques, Silom is the place to go, as most potential buyers stay there in expensive hotels. <b>River City</b> in Yaowarat is the largest antique mall of the city, and priced to match. <b>Gold and gems are popular buys, but be careful:</b> know what you\'re looking for such as quality of workmanship and gold/stones and what something like it costs back home. If possible by prior research, not street vendor recommendation, go to respected jewellers, and polish your bargaining skills. Many tourists buy worthless pieces of cut glass believing it to be valuable gems. Others get jewellery or gems at unjustified costs. Never let a tuk-tuk driver take you to a gem/jewelry store; more often than not, you\'ll be ripped off and he\'s getting a commission for taking you there. The same advice applies to tailoring shops; you can get a custom-made suit at low prices, but you have to know where to go, as many tailors provide bad quality — see the sidebar for advice on finding a good tailor.\nBrowsing second hand English-language books can best be done on Khao San Road. For new releases, there are plenty of chain stores in shopping plazas, including <b><a data-object_type="poi" data-id="T__35c0da0e9314">Asia Books</a></b>, <b>B2S</b>, <b>Bookazine</b> and <b>Kinokuniya</b>. There\'s a particularly wide array of books on Asian culture and history; some have a good selection of foreign newspapers and magazines as well.\nGetting cash in Bangkok is relatively easy. Credit cards are widely accepted at larger establishments and ATMs are spread all over the city, especially in central areas. All banks ATMs charge a 180 baht commission for using foreign cards at ATMs. <a href="http://www.superrichthailand.com/#!/"></a><a data-object_type="poi" data-id="T__f9df03a7f2de">Super
Rich</a> money exchanges offer decent rates of exchange.',
                'image': None,
                'title': 'Buy'
            }, {
                'body': 'Bangkok boasts a stunning 50,000 places to eat; not only thousands of Thai restaurants, but a wide selection of world-class <b>international cuisine</b> too. Prices are generally high by Thai standards, but cheap by international standards. A good meal is unlikely to cost more than 300 baht, although there are a few restaurants where you can easily spend 10 times this.\nSukhumvit by far has the best restaurants of Bangkok, though prices tend to be high. Practically every cuisine in the world is represented here, be it French, Lebanese, Mexican, Vietnamese, or fusion combining many of these together in a quirky, but delicious mix. Bangkok\'s Italian town is <b>Soi Ton Son</b> near Siam Square. Of course, for those on a budget, street stalls abound with simple
Thai dishes at around 30 baht. There are especially plenty of budget restaurants in Khao San Road.\nThere are plenty of <b>vegetarian restaurants</b> in the more tourist-friendly parts of town (especially in hippie district Khao San Road). Vegetarian dishes are also readily available on the menus of regular restaurants. On request, even typical street restaurants will easily cook a vegetarian equivalent of a popular Thai dish for you. Ask for "jay" food to leave the meat out of the dish. For example, "khao pad" is fried rice and "khao pad jay" is vegetarian fried rice. For vegans, the most common animal product used would be oyster sauce. To avoid it, say "mai ao naam man hoi". Be aware that all street noodle vendors use meat broth for noodle soup.\nDon\'t miss out on a cold <b>ice cream</b> in hot Bangkok. Western chain stores <b>Dairy Queen</b> and <b>Swensen\'s</b> have booths in many malls and shopping centres. Or better yet, try an exotic fruit-flavoured ice cream at an <b>Iberry</b> shop. Their ice creams are tasty, cheap and safe to eat.',
                'image': {
                    'attribution': {
                        'license_link': 'http://creativecommons.org/licenses/by-sa/3.0',
                        'attribution_link': 'https://commons.wikimedia.org/wiki/File:Phat_Thai_kung_Chang_Khien_street_stall.jpg',
                        'attribution_text': 'Takeaway',
                        'license_text': 'CC BY-SA 3.0',
                        'format': '{attribution} / {license}'
                    },
                    'license': 'CC BY-SA 3.0',
                    'sizes': {
                        'medium': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pjlSd0T9ToGEbMrR6gIyjEVQGcLGYU-B8hg7eYgnehuCg6059ucvf96JLYKqjT5E4pwOmCy1JmYrZ45n39d24kXFeejUW041EKhBsU_iSeJBZs3-Fs3H3CF79ulcjNfpfBFQE4sD17EDbrZQvySfCUApHCoUss_eyJpg-QDzb_ZwFQoRE88KwdT46L3SlXHJwZdIZTUO51t6YixSmpQpm3tdKOgy90ip5nSqJMI6Y6p0=',
                            'width': 640,
                            'bytes': 67019,
                            'height': 640
                        },
                        'thumbnail': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pqj7bQsek9-iGW0-c2Zq29JdKjMjf34j9i2F4c85tLjYd_pdukIqQLLO03l99JgAjI5CGTqkAmbpZtmsB1UB2vELYXXTlaNMDoXQpk69fS5QSaKd866SfGwsm0r-rQUIHjYDohEZ44sblIKHV_mRzNCwsusIjDHY59q9gJCXFj8f04hCkK8qPLB8tNUYu1da44EbGAForIxiNxZ7jaLJ__Ny5YdOf-Zh68rf1FHV5_MQ=',
                            'width': 192,
                            'bytes': 11664,
                            'height': 192
                        },
                        'original': {
                            'url': 'https://upload.wikimedia.org/wikipedia/commons/3/39/Phat_Thai_kung_Chang_Khien_street_stall.jpg',
                            'width': 2500,
                            'bytes': 1349394,
                            'height': 2500
                        }
                    },
                    'owner': 'Takeaway',
                    'source_url': 'https://upload.wikimedia.org/wikipedia/commons/3/39/Phat_Thai_kung_Chang_Khien_street_stall.jpg',
                    'caption': 'Pad Thai',
                    'source_id': 'wikivoyage',
                    'owner_url': 'https://commons.wikimedia.org/wiki/File:Phat_Thai_kung_Chang_Khien_street_stall.jpg'
                },
                'title': 'Eat'
            }, {
                'body': "While not particularly high class, street food is among the most delicious food and can be found all over Bangkok—wherever you're staying, you rarely have to walk more than 100 m for a cart or street restaurant. Many street vendors sell <b>satay</b> with hot sauce for 5-10 baht a piece.\nOne of Thailand's national dishes you can try is <b>pad thai</b> (ผัดไทย), stir-fried rice noodles with eggs, fish sauce, tamarind juice and red chili pepper. It c
an be prepared for you on one of the ubiquitous carts or served in a street restaurant for about 50 baht. You can order it with chicken (<i>kai</i>) or shrimps (<i>kung</i>). Another one of Thailand's national dishes you should try is <b>tom yam kung</b> (ต้มยำกุ้ง), a sour soup with prawns, lemongrass and galangal—beware, as it is <i>very</i> spicy! <b>Khao man kai</b> (ข้าวมันไก่) is another popular street food. You can identify
it at stalls displaying boiled chicken. Served with a bowl of fragrant chicken soup is a mound of rice topped with sliced chicken pieces and cucumber. Side sauces are spicy and go well with the bland chicken and rice. You can sometimes add optional liver and gizzard if that is your taste. If you like sweets, try to find a <b>kanom roti</b> (โรตี) street vendor. The crepe-like dessert is filled with sweetened condensed milk, lots of
 sugar and can also have bananas inside. Also fun to watch them being made.\n\nKhao San Road is known for its carts selling <b>bugs</b>—yes, insects. They are deep fried, nutritious and quite tasty with the soy sauce that is sprayed on them. Types available: scorpions, water beetles, grasshoppers, crickets, bamboo larvae, mealworms and some seasonal specialties. Break off the legs from grasshoppers and crickets or they will get stuck in your throat.\nAround the corner from Khao San Road in front of the department store and supermarkets the street is lined with a myriad stalls selling all manner of tempting delicacies: sweets and crackers, coconut jellies, candied fruits, fish balls on skewers, tamarind sweets dipped in chili and sugar and a host of other delights.",
                'image': {
                    'attribution': {
                        'license_link': 'http://creativecommons.org/licenses/by-sa/3.0',
                        'attribution_link': 'https://commons.wikimedia.org/wiki/File:Insect_vendor_in_Bangkok,_Thailand.JPG',
                        'attribution_text': 'Dudva',
                        'license_text': 'CC BY-SA 3.0',
                        'format': '{attribution} / {license}'
                    },
                    'license': 'CC BY-SA 3.0',
                    'sizes': {
                        'medium': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2p0uNnvt4bJuUU8t7AwJpeGV_1Q2Xu5cw7FMoS7cECUErVPHxMl0LhWQ1o7BeArzGpZBi27Xt_3Da7gRJHWdFgNxSRz4Ksp0BJ7G6jpJ5grsDjsHeJ8k6uoEFtUt1Gi4Z1Q9gPh6sfiDFQ8JoFciUDeQdTcFQvXwxityMlZBE26erfo-5YAh6iAEFuKKLFzqxiAeyziP0PUNlE9c95Ruj3Yu0O5UZA7owf7XgyQ_25_W4=',
                            'width': 640,
                            'bytes': 84218,
                            'height': 480
                        },
                        'thumbnail': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2p_YBq_1xPd36zzBBequPmnpYHVh9fOiieUxJ5oQ8Z5qZ2mBg9HUn96k_T62nXuN3UusDbsCy8rwNLaI_2EmvXJOVpIw3sUwxzMtRIj5VEsCJAMfIYMBhPFvwMz0qcez4l2rjtNz9Cg3ULhbsCnklI2Qi7AgbWFswt7YtcSstgxPgNsZzmIxgBbsqhWZ1hGAPTNha9sVgeyaHKe7wj7j1rMkvmqnhn12NPJBPX5Lsfcqw=',
                            'width': 192,
                            'bytes': 12083,
                            'height': 144
                        },
                        'original': {
                            'url': 'https://upload.wikimedia.org/wikipedia/commons/9/9a/Insect_vendor_in_Bangkok%2C_Thailand.JPG',
                            'width': 4000,
                            'bytes': 2940521,
                            'height': 3000
                        }
                    },
                    'owner': 'Dudva',
                    'source_url': 'https://upload.wikimedia.org/wikipedia/commons/9/9a/Insect_vendor_in_Bangkok%2C_Thailand.JPG',
                    'caption': 'Insects—ready for a snack?',
                    'source_id': 'wikivoyage',
                    'owner_url': 'https://commons.wikimedia.org/wiki/File:Insect_vendor_in_Bangkok,_Thailand.JPG'
                },
                'title': 'Street food'
            }, {
                'body': 'Thai dishes can roughly be categorised into central, northern, northeastern and southern cuisine. What\'s so great about Bangkok is that all these cuisines are present. <b>Isaan food</b> is popular; generally street restaurants serve on plenty of small plates that can be shared. <b>Som tam</b> (ส้ม
ตำ) is a salad made from shredded and pounded raw papaya — again, it is <i>spicy</i>, but oh so delicious. If you want to dine the Isaan way, also order some <b>khao niew</b> (sticky rice), <b>kai yang</b> (grilled chicken) and <b>moo yang</b> (grilled pork). Isaan food is very spicy; say <i>mai pet</i> or <i>pet nit noy</i> to tone it down. Southern Thai cuisine is also worth it; many of them have congregated around <a data-object_type="poi" data-id="T__91414db738c3">Wang Lang</a> in Thonburi. At least try the <b>massaman curry</b> (แกงมัสมั่น), it\'s delicious.\nThe place to go to for <b>Chinese food</b> is Yaowarat. It has a range of street stalls and cheap restaurants selling expensive delicacies at affordable prices. <b>Soi Phadung Dao</b> is the best street for huge seafood restaurants. Try 1 kg of huge barbecued prawns for about 300 baht. Phahurat, Ba
ngkok\'s Little India, has some decent Indian restaurants.',
                'image': None,
                'title': 'Ethnic cuisine'
            }, {
                'body': 'Dinner cruises on the Chao Phraya River are a touristy way of spotting floodlit temples while chowing down on seafood and watching Thai cultural performances. Most operate buffet-style and the quality of the food is so-so, but there\'s lots of it and it\'s not too spicy. While the river can give a romantic experience, it can also be dirty and smelly with lots of plants floating around.\nNote that drinks and tips are usually <i>not</i> included in the listed prices below. Always make a reservation before heading out to the pier. There are many competing operators, most of them depart from the <b>River City</b> pier next to the <b>Si Phraya</b> Express Boat pier. Major operators include:\n\n<ul>\n<li> <strong>Chao Phraya Princess</strong>, 723 Supakarn Building, Charoen Nakhorn Rd, +66 2 860-3700. Departure 19:30. Large operator with four modern air-conditioned boats seating up to 250 people. Departure from River City pier. 1,300 baht.</li>\n</ul>\n<ul>\n<li> <strong>Loy Nava</strong>, 1367 Charoen Nakhorn Rd, +66 2 437-4932. Departure 18:00 or 20:10 daily. This dinner cruise heads out with 70-seater rice barges. Departure from Si Phraya pier (near River City), and there is
a free pickup from most hotels. 1,400 baht.</li>\n</ul>\n<ul>\n<li> <strong>Manohra</strong>, 257 Charoen Nakhorn Rd, +66 2 477-0770. Departure 19:30 daily. These restored Thai rice barges seat 40 people. Departure from Marriott Resort pier, with an optional pick-up from Saphan Taksin BTS station. 1,250-1,990 baht.</li>\n</ul>\n<ul>\n<li> <strong><a data-object_type="poi" data-id="T__985f7d2a44b9">Wan Fah</a></strong>, 292 Rachawongse Rd, +66 2 222-8679. Departure 19:00 daily. These two-hour dinner cruises include a set meal of farang-friendly Thai food and seafood, live music and Thai classical dancing. Departure from River City. 1,000 baht.</li>\n</ul>\n<ul>\n<li> <strong>Yok Yor Marina</strong>, 885 Somdet Chao Phraya Soi 17, +66 2 863-0565. Departure 20:00. Operated by the famous seafood restaurant, this is a much more local (and cheaper) option than the tourist cruises: pay a 160 baht "boat fee" and then order off the menu at normal restaurant prices. Departure from Yok Yor Marina on the Thonburi side of the river. There is a free shuttle service from Saphan Taksin BTS station.\n</li>\n</ul>',
                'image': None,
                'title': 'Dinner cruises'
            }, {
                'body': 'Bangkok\'s nightlife is <b>infamously wild</b>, but it\'s not quite what it used to be. Due to recent social order campaigns, there have been quite a few crack-downs on opening hours, nudity, and drug use. Most restaurants, bars and clubs are now forced to close at 01:00, although quite a few are allowed to stay open till 02:00 or later. Informal roadside bars do stay open all night, particularly in Sukhumvit and Khao San Road. You must carry your <b>passport</b> for ID checks and police occasionally raid bars and discos, subjecting all customers to <b>drug tests</b> and searches, though these mostly occur at places that cater for high-society Thais.\nOne of Bangkok\'s main party districts is Silom, home not only to perhaps the world\'s most famous go-go bar strip, <b>Patpong</b>, but plenty of more legitimate establishments catering to all tastes. For a drink with a view, the open-air rooftop bars of <b>Vertigo</b> and <b>Sirocco</b> are particularly impressive. A large number of superhip and more expensive bars and nightclubs can be found in the higher sois of Sukhumvit, including <b>Bed Supperclub</b>, <b>Q Bar</b>, and <b>Narz</b>, as well as the hip area of <b><a data-object_type="poi" data-id="Thong_Lo">Thong Lo</a></b> .\nHippie hangout Khao San Road is also slowly gentrifying and a score of young artsy Thai teenagers have also made their mark there. Going out in Khao San Road is mostly casual, sitting at a roadside bar watching people pass by, but the <b>Gazebo Club</b> is a nightclub that stays open till the sun gets up. Most of the younger Thais prefer to congregate around Ratchadaphisek, home to the <b><a data-object_type="poi" data-id="T__3d644f156d95">Royal City Avenue</a></b> strip of nightclubs where you can find popular nightclubs like 808, <a data-object_type="poi" data-id="T__8e3a9899f991">Route 66</a>, Cosmic Cafe, and more.\nRCA, the <b><a data-object_type="poi" data-id="T__3d644f156d95">Royal City Avenue</a></b> strip, is home to much more than nightclubs. You will be able to find fun karaoke clubs, go-carting, arcades and bars like the Overtone Music Cave which is a place where music students to perform. The Overtone Music Cave is frequently visited by recording artists as well as music students and is becoming a real Bangkok music hot spot.\nSmoking is forbidden in all restaurants, bars and nightclubs, whether air-conditioned or non-air-conditioned. It is enforced at some venues, but the ordinance is flouted in areas such as <a data-object_type="poi" data-id="W__26739660">Nana Plaza</a>.',
                'image': {
                    'attribution': {
                        'license_link': 'http://creativecommons.org/licenses/by/2.0',
                        'attribution_link': 'https://commons.wikimedia.org/wiki/File:Bangkok_Sirocco.jpg',
                        'attribution_text': 'Tumitu Design',
                        'license_text': 'CC BY 2.0',
                        'format': '{attribution} / {license}'
                    },
                    'license': 'CC BY 2.0',
                    'sizes': {
                        'medium': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2p5fopvUo1-4rAF3WrNUTfcdREk0lhsLN4vTFeSpvg3l93te2LYeUza9zJmaXAvQOR3lnxfFMMCShsQurpCmnVJLXh3QtLtdAm9WdiShe8qP3-4pPubig_pp69KmWsh0Hkw-qaXXg9dSDuCk-rjMlA3bjw3n7TZeWVJ3qFFsEb-Q_9dsSJhuvJ3ok43b8XR-KldlOUz2kGznJ14QEBknUH9R_tmOPXpqcM3Tr_T3zRaEc=',
                            'width': 480,
                            'bytes': 38016,
                            'height': 640
                        },
                        'thumbnail': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2poG350LWRb2EHpCj6V1LRHu1B_dHbkWPzVZkbBPbeAYGw_V_evJoj-OW0_YU7O0Gbgv59lbNRbylztwaJANjcdcu_cXU9ecbRBLV_QsMUBbQGUL7SvEkADLL8p8pwA9Qq7jTxCmIKatUcOnGtt0Q81OYoIkay8W0iFw9-429_Nu9b6h_d1v72mHYdt7Quo6SB-crD_c4KJz0oMMmnEhSemhjLd2OZNOXVZtG-te65Ifo=',
                            'width': 144,
                            'bytes': 7264,
                            'height': 192
                        },
                        'original': {
                            'url': 'https://upload.wikimedia.org/wikipedia/commons/1/16/Bangkok_Sirocco.jpg',
                            'width': 1200,
                            'bytes': 808639,
                            'height': 1600
                        }
                    },
                    'owner': 'Tumitu Design',
                    'source_url': 'https://upload.wikimedia.org/wikipedia/commons/1/16/Bangkok_Sirocco.jpg',
                    'caption': 'Sirocco at State Tower, Silom',
                    'source_id': 'wikivoyage',
                    'owner_url': 'https://commons.wikimedia.org/wiki/File:Bangkok_Sirocco.jpg'
                },
                'title': 'Drink'
            }, {
                'body': 'The <b>go-go bar</b> is an institution of Bangkok\'s "naughty nightlife". In a typical go-go, several dozen dancers in bikinis crowd the stage, shuffling back and forth to loud music and trying to catch the eye of punters in the audience. Some, but not all, also put on <b>shows</b> where girls perform on stage, but these are generally tamer than you\'d expect. Nudity, for example, is technically forbidden. These are no Western- or US-style strip clubs. Expect a stage
in the middle with seating all around, and 5-10 girls just dancing or standing around on stage in various states of undress. No lap dances, but girls will sit with you for the price of a lady drink. In a <b>beer bar</b>, there are no stages and the girls wear "street clothes".\nIf this sounds like a thinly veiled veneer for prostitution, it is. Although some point to the large number of American GIs during the Vietnam War as the point of origin of the Thai sex trade, others have claimed that current Thai attitudes towards sexuality have deeper roots in Thai history. Both go-go and beer bars are squarely aimed at the <i>foreign tourists</i> and it\'s fairly safe to assume that most if not all Thais in them are on the take. That said, it\'s perfectly OK to check out these shows without actually partaking, and there are more and more curious couples and even the occasional tour group attending. The main area is around <b>Patpong</b> in Silom, but similar bars to the ones at Patpong can be found in Sukhumvit, at <b>Nana Entertainment Plaza</b> (Soi 4) and <b><a data-object_type="poi" data-id="Soi_Cowboy">Soi Cowboy</a></b> (Soi 23). <b>Soi 33</b> is packed with hostess bars, which are more upscale than the <a data-object_type="poi" data-id="Soi_Cowboy">Soi Cowboy</a> and <a data-object_type="poi" data-id="W__26739660">Nana Plaza</a> bars and do not feature go-go dancing. Before heading to these places, be sure to read the Stay safe section for some additional advice.\nAs go-go bars close around 01:00, there are so-called <b>after-hour clubs</b> that stay open till the sun comes up. They are not hard to find—just hop in a taxi. Taxi drivers are eager to drive you there, as they get a hefty commission from club owners to bring you to them. You might even get the ride for free. These clubs generally feel grim and edgy, and there are so-called "freelancers" among the girls (prostitutes). Some well-known after-hour clubs include <b>Bossy Club</b> in Pratunam, <b>Spicy Club</b> near Siam Square and the always famous <b>Thermae</b> on Sukhumvit between sois 15 and 17 in the basement underneath the <b>Ruamchit</b> short-time hotel.',
                'image': None,
                'title': 'Go-go and beer bars'
            }, {
                'body': 'Thais are generally accepting of homosexuality and Bangkok has a very active gay nightlife scene, concentrated in Silom\'s Soi 2, Soi 4 and a short strip of gay go-go bars known as <b>Soi Twilight</b> . Gay strip bars all have free entry, but charge an extra 150 baht or so for drinks. The most popular gay drinking bars are <b><a data-object_type="poi" data-id="T__092a57815d48">The Balcony</a></b> and <b><a data-object_type="poi" data-id="T__b56b0deb190c">Telephone Pub</a></b> at Silom Soi 4, which are busy until 23:00. For the disco crowd, <b><a data-object_type="poi" data-id="T__331ad6e6b7eb">DJ Station</a></b> and its late-night neighbour <b><a data-object_type="poi" data-id="T__c55601bdf66f">G.O.D. Club</a></b> (Silom Soi 2) are packed every night beginning around 23:00. Between 17:00-22:00 over 200 men from around the world cruise, swim, dine, and party at the nearby <b>Babylon</b>, considered by many to be the best gay sauna in the world. Babylon also has budget and luxury accommodation.\nAll of these bars and clubs are aimed at gay men and the lesbian scene is much more low-key. Since the opening of full-time lesbian bars <b>Zeta</b> and <b>E-Fun</b>, a small lesbian community is starting to emerge along Royal City Avenue. <b>Lesla</b>
(near Phahonyothin) is a lesbian bar that is open on Saturday nights only. Bring along your passport for entrance age checking (they do not allow people under 20 years old).\nIn a league of their own are Bangkok\'s numerous <b>transsexuals</b> (<i>kathoey</i>), both pre- and post-operative, popularly known as <b>ladyboys</b>. A part of Thai popular culture for ages, kathoey face increasing prejudice as Thailand imports rigid Western gender concepts. Many male Westerners obsess about the risks of "mistaking" a ladyboy for a "real" woman, in the fear that being attracted to them would make of them homosexuals. Tired clichés about "tall, large-handed, large breasted transsexuals with garish makeup" are belied by the fact that most kathoeys strive to blend in with the general population. However, legal change of gender is not possible in Thailand, which means they find it difficult to access many "respectable" jobs. Some work in the famed <b>transvestite cabarets</b> and there are some dedicated <i>kathoey</i> bars as well.\nNote that some Thai regulars in the gay nightlife scene skirt the fine line between partying and prostitution, and the Western visitor, being considered richer, is expected to pay any food and drink expenses and perhaps provide some "taxi money" in the morning. It\'s
usually wise to ask a boy you pick up in a bar or club if he is after money, as it\'s not uncommon for them to start demanding money after sex.',
                'image': None,
                'title': 'Gay nightlife'
            }, {
                'body': "Given its size, Bangkok is surprisingly safe, with violent crimes like mugging and robbery unusual. One of the biggest dangers are motorbikes who ride on pavements at speed, go through red lights, undertake buses as they stop to let passengers off and generally drive far too fast especially through stationary traffic. If you are going to hire a bike, make sure you have insurance in case you are injured. You may be the world's best driver but you'll meet many of the world's worst drivers in Thailand.\nBangkok does have more than its fair share of <b>scams</b>, and many individuals in the tourist business do not hesitate to <b>overcharge</b> unwary visitors. As a rule of thumb, it is wise to decline all offers made by someone who appears to be a friendly local giving a hapless tourist some local advice. Never get in a tuk-tuk if someone else is trying to get you into one. Most Bangkok locals do not approach foreigners without an ulterior motive.",
                'image': None,
                'title': 'Stay safe'
            }, {
                'body': 'You should always be on the look-out for scammers, especially in major tourist areas. There are dozens of scams in Bangkok, but by far the most widely practiced is the <b>gem scam</b>. Always beware of tuk-tuk drivers offering <b>all-day tours for prices as low as 10 baht</b>. You may indeed be taken on a full-day tour, but you will end up only visiting one gem and souvenir shop after another. Don\'t buy any products offered by pushy salesmen — the "gems" are pretty much always worthless pieces of cut glass and the suits are of
deplorable quality. The tuk-tuk driver gets a commission if you buy something — and fuel coupons even if you don\'t. Unless the idea of travelling by tuk-tuk appeals to you, it\'s almost always cheaper, more comfortable and less hassle to take a metered taxi.\nBe highly skeptical when an English-speaking Thai at a popular tourist attraction approaches you <b>out of the blue</b>, telling that your intended destination is <b>currently closed</b> or offering discount admissions. Temples are almost always free and open just about every day of the year. Anyone telling you otherwise, even if they have an official-looking identification card, is most likely out to scam you, especially if they suggest a tuk-tuk ride to some alternate sights to see until the sight re-opens. At paid admission sites, verify the operating hours at the ticket window.\n\nIf you entered one of these tuk-tuks, touts will often drop you off at a certain place, such as a genuine Buddhist temple. Here you will find a man that claims to be an official, and he guides you in a certain direction. There you will find another "official" who also claims that a certain attraction is closed. This way, a tourist hears the same statement by multiple people, and is more eager to believe that his or her intended destination indeed is closed. Never get involved with these scammers or believe any of their statements.\nWhen getting a taxi, it is a good idea to <b>hail a moving taxi</b> from the main road, or to walk a short distance out of a major tourist area before looking for one. This is no guarantee of honesty, but greatly increases your chances of finding an honest driver, of which there are plenty in Bangkok, even if it sometimes seems that every driver is on the make. There are some taxi drivers who switch off their meters, and insist on a silly price. Most of the untrustworthy drivers are the ones standing still in tourist areas. Another important rule of thumb is to <b>insist on the meter</b> for taxis and <b>agree on a price in advance</b> for tuk-tuks. If they refuse, or quote silly prices, just walk out and get a different one as they\'re rarely in short supply. The Thai phrase to ask a driver to use the meter is <i>mee-TOE, khap</i> if you\'re male and <i>mee-TOE, kha</i> if you\'re female.\nBeware of tuk-tuk or taxi drivers who approach you speaking good English or with an "I ♥ farang" sign, especially those who mention or take you to a tailor shop (or any kind of business). They are paid by inferior tailor shops to bring tourists there to be subjected to high pressure sales techniques. If at any point your transportation brings you somewhere you didn\'t intend or plan to go, walk away immediately, ignore any entreaties to the contrary, and find another taxi or tuk-tuk.\nIn general, never ask a taxi driver for a recommendation for something. They will likely take you to a dubious place where they get a commission. In particular, <b>do not ask a taxi driver for a restaurant recommendation</b>. An infamous place taxi drivers take unsuspecting tourists is Somboon D, which is a terrible seafood restaurant in a seedy area under the train tracks on Makkasan Road (☎ +66 2 6527-7667). A typical meal there costs 800 baht per person and it comes with little seafood, no service and complaints are not taken by the management.\nAlso beware of <b>private bus companies</b> offering direct trips from Bangkok to other cities with "VIP" buses. There are a lot of scams performed by these private bus companies. The so-called direct VIP trips may end up changing three or four uncomfortable minibuses to the destination, and the 10-11 hour trip may well turn into 17–18 hours. Instead, try to book public Transport Co. buses from the main bus terminals. It\'s worth the extra shoe-leather, as there have been reports of robberies on private buses as well.',
                'image': {
                    'attribution': {
                        'license_link': 'http://creativecommons.org/licenses/by/2.0',
                        'attribution_link': 'https://commons.wikimedia.org/wiki/File:Tuktuks_in_Bangkok.jpg',
                        'attribution_text': 'HellonEarth2006 from Oldham, Lancashire, United Kingdom',
                        'license_text': 'CC BY 2.0',
                        'format': '{attribution} / {license}'
                    },
                    'license': 'CC BY 2.0',
                    'sizes': {
                        'medium': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2poTu980dfen_iA8y1LtSUZ2bc_4jfd8y9yYRGjF6RaI2pUDOz8aKt3AgwOMBRBQ18Q7XEKbTl69r0FJT8knsy4IAUBiTuDXfWxrrBZWwi_Rxfrai3Ln-FaSBVdjpFQj9jpMwiaCUdEgXWfCGX4lcK5D5IyYcrtSwjMvyVH0ABUGwVj2IbXFn1j9Hctja7wrY9HIV_nYOyXgMGydGMQOnk0Nu0udvVg4DEpMxCIgEP2CU=',
                            'width': 426,
                            'bytes': 61490,
                            'height': 640
                        },
                        'thumbnail': {
                            'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2p1rxWdr8fv-DURecgcnGuu73uraqGeDgihDfOxRBFQKlI3cOHBeyUhoW6pUdTL0VfY7sQWD6cw01ASBkzTC7n50ePXYNxU7gOfYzuhm_eN4BAUVVILkKpJqY_zAE4s_3knwlIrkDuSHaYZ8YEWw6DKQUkM5NaRlVnL4DcIb6wI8MwwFB3Ai6nCMlrylRoiPEBNtuSqLKqytCtJF-IYipou6pxsoBptuqu2n3D3ITaaeg=',
                            'width': 128,
                            'bytes': 9922,
                            'height': 192
                        },
                        'original': {
                            'url': 'https://upload.wikimedia.org/wikipedia/commons/e/e7/Tuktuks_in_Bangkok.jpg',
                            'width': 1288,
                            'bytes': 2792197,
                            'height': 1936
                        }
                    },
                    'owner': 'HellonEarth2006 from Oldham, Lancashire, United Kingdom',
                    'source_url': 'https://upload.wikimedia.org/wikipedia/commons/e/e7/Tuktuks_in_Bangkok.jpg',
                    'caption': 'Tuk-tuks in Bangkok',
                    'source_id': 'wikivoyage',
                    'owner_url': 'https://commons.wikimedia.org/wiki/File:Tuktuks_in_Bangkok.jpg'
                },
                'title': 'Scams'
            }, {
                'body': 'Bangkok is known for its go-go bars and the prostitution that comes along with it. Some aspects of prostitution are illegal but enforcement is rare, and brothels are common. It\'s not illegal to pay for sex or to pay a "barfine" (a fee the bar collects if you want to take an employee away).\nThe age of consent in Thailand is 15, but is 18 for prostitutes. Penalties for sex with minors are harsh. All adult Thais must carry an identity card, which will state the year of their birth according to the Buddhist calendar. Many hotels retain the ID cards of prostitutes for the duration of their visit. Whilst most prostitutes are employed by bars or similar businesses, some are "freelancers". Petty theft and other problems, such as slipping the customer sleep drugs, are allegedly more common with these freelancers (although still relatively rare). HIV and AIDS awareness is better than it used to be, but infection statistics among entertainment industry workers remain high; freelancers are the highest risk group. Almost all girls insist on using condoms.\nWhile walking in go-go bar areas is generally safe, you have to be cautious of touts who try to drag you into the <b>upstairs bars</b> with offers of ping-pong shows and 100-baht beer. The beer may well be 100 baht, but the "show" you\'ll be treated to will be 1,000 baht or more. The rule of thumb is that if you cannot see inside from street level, avoid the establishment.',
                'image': None,
                'title': 'Go-go bars'
            }, {
                'body': 'Do not get into fights with locals. Thais are peace loving people, but when a Thai fights a foreigner, it is never a fair fight. You\'ll wind up having to fight 10-20 others who were not initially involved, or the police will be called and not do anything to assist you, especially the Metropolitan Police, as they normally have very limited English skills; always contact the <a data-object_type="poi" data-id="T__1d7da8b28082">Tourist Police</a> when in trouble. Thais are also notorious for fighting with weapons (guns, knives, broken bottles, metal rods) or employing <a data-object_type="poi" data-id="T__9acf96d2be7e">Muay Thai</a> techniques. These are usually produced from their concealed locations, with foreigners getting seriously injured or worse. Just avoid all confrontations. If you do get involved in a situation, it is better to apologise and leave: in Thailand, discretion is definitely the better part of valour.',
                'image': None,
                'title': 'Fights'
            }, {
                'body': "Elephants are a large part of Thailand's tourist business, and the smuggling and mistreatment of elephants for tourist attractions is a widespread practice. Be aware that elephants are often separated from their mothers at a young age to be cruelly trained under captivity for the rest of their lives. It is advised to take an <b>elephant ride</b> only at animal friendly organisations.\nA depressingly common sight on the congested streets of Bangkok is <b>elephant begging</b>. During night hours, mahouts with lumbering elephants approach tourists to feed the creatures bananas or take a photo with them for a fee. The elephants are brought to the city to beg in this way because they are out of work and are mistreated and visibly distressed under the conditions of the city. Please avoid supporting this cruelty by rejecting the mahouts as they offer you bananas to feed the elephants. This is especially common in Silom and Sukhumvit.\nDue to its location, lax laws, and resources, many <b>illegal animal products</b> come through Bangkok. Rare and endangered species are often sold at markets for pets, especially at Chatuchak, and many other animal products are sold as luxury items. Avoid buying rare pets, leather, ivory, talons, dried sea creatures (such as starfish), fur, feathers, teeth, wool, and other products since they are most likely the result of illegal poaching, and buying them contributes greatly to animal endangerment and abuse.",
                'image': None,
                'title': 'Animal abuse'
            }, {
                'body': "In 2008, <b>political unrest</b> hit the headlines, with the yellow-shirt People's Alliance for Democracy closing down both of Bangkok's airports for a week. Several people were killed in the resulting political violence. After a PAD-backed prime minister was elected, the protests ceased for a while, but the situation remained unstable. In 2010, new political unrest surfaced with red-shirt protesters from the United Front for Democracy Against Dictatorship (UDD) occupying much of Sukhumvit and surrounding areas. These protests turned violent when government troops tried to take back parts of central Bangkok that had been seized by protesters. In 2011, a UDD supported government took power. Since then, protests by both the PAD and UDD have continued to occur on a sporadic basis depending on what political event has transpired. Always follow the independent press for the newest political developments and stay away from demonstrations.",
                'image': None,
                'title': 'Political unrest'
            }, {
                'body': "As elsewhere in Thailand, be careful with what you eat. Outside of major tourist hotels and resorts, stay away from raw leafy vegetables, egg-based dressings like mayonnaise, unpackaged ice cream and minced meat as hot weather tends to make food go bad faster. In short, stick to boiled, baked, fried or peeled goods.\nTap water in Bangkok is said to be safe when it comes out the plant, but unfortunately the plumbing along the way often is not, so it's wise to avoid drinking the stuff, even in hotels. Any water served to you in good restaurants will at least be boiled, but it's better to order sealed bottles instead, which are available everywhere at low prices.\nTake care with ice, which may be made with tap water of questionable potability as above. Some residents claim that ice with round holes is made by commercial ice makers who purify their water; others state that it is wise not to rely on that claim.",
                'image': None,
                'title': 'Food and water'
            }, {
                'body': '',
                'image': None,
                'title': 'Connect'
            }, {
                'body': 'Internet cafés abound in Bangkok. Typical costs are 30-60 baht per hour in tourist districts such as Khao San Road, 20-30 baht per hour and 10-15 baht per hour if you would venture into residential areas (where the speed generally is still high).\nAn increasing number of cafés and pubs offer free Wi-Fi to their customers, including the ubiquitous <b><a data-object_type="poi" data-id="T__773ed8d0020c">Coffee World</a></b> chain in all of its branches; ask staff for the password. <b>TrueMove</b> offers both free and paid Wi-Fi access. If you want to get online for free, you must register first, and both session and time is limited. Their network is accessible in many malls, including Siam Square, and sometimes can be available from your room if you stay in
a nearby hot-spot — just look for the \'truewifi\' network, you can register. Most hotels and guest houses provide some form of Internet.\nThere is not a lot of free Wi-Fi available in old districts like Rattanakosin or Yaowarat. Note at McDonald\'s and Starbucks either Wi-Fi I is not available or access costs.\nIf you are staying for more than a couple of days and prefer to stay connected without being limited to hotspots, a prepaid SIM card with mobile data is a good option. Being able to use a smartphone for navigation and reviews is very useful in a city where recommendations and directions offered by locals are not always reliable. See the Telephone section for details.',
                'image': None,
                'title': 'Internet'
            }, {
                'body': "The area code for Bangkok is <b>02</b>. You only need to dial the 0 if you're calling from within Thailand. Pay phones are not commonplace, as most Thais have a mobile phone. If you want to avoid high roaming costs, you can buy a local SIM card for 100 baht at Suvarnabhumi Airport or mobile phone shops throughout the city. The 100 baht is not just for the SIM card, but is immediately your first pre-paid amount. Topping it up is easy, such as at 7-Eleven convenience stores. Making international calls is also cheaper this way.\nAs of July 2014, the True booth at Suvarnabhumi Airport is offering free tourist Sim cards preloaded with 10 baht calling credit as well as 20 MB of 3G access.",
                'image': None,
                'title': 'Telephone'
            }, {
                'body': 'Bangkok\'s red post boxes are found all over the city. There are also plenty of <b><a href="http://www.thailandpost.com/"></a><a data-object_type="poi" data-id="T__62e28a6a48aa">Thailand Post</a></b> offices around for sending post and packages. In tourist areas, there are post offices in the Khao San Road area and at <a data-object_type="poi" data-id="Sukhumvit_Road">Sukhumvit Road</a> (between Soi 4 and 6).\nIf you\'re staying in Bangkok for a longer time, you might want to make use of <i>poste restante</i>, so other people can send you letters or parcels using a post office\'s address. Post offices keep the letters for at least two months. Letters sent via poste restante must have the receiver\'s name on it, with the family name in underlined capital letters. If you want to pick them up near Khao San Road (opposite Wat Bowonniwet), it must be addressed to Poste Restante, Banglamphubon Post Office, Bangkok, 10203, Thailand. If you want to pick up your post in the Sukhumvit area, address it to Poste Restante, Nana Post Office, <a data-object_type="poi" data-id="Sukhumvit_Road">Sukhumvit Road</a>, Bangkok, 10112, Thailand.',
                'image': None,
                'title': 'Post'
            }, {
                'body': '',
                'image': None,
                'title': 'Cope'
            }, {
                'body': "<ul>\n<li> <strong>Bangkok Post</strong>. One of the better English-language newspapers of the country, but also includes sections on travel, leisure, entertainment, life and classifieds in Bangkok.</li>\n</ul>\n<ul>\n<li> <strong>BK Magazine</strong>. Bangkok's premier city living magazine; a guide to the city's restaurants, nightlife, travel, arts and more. New additions release weekly and are distributed in selected venues.</li>\n</ul>\n<ul>\n<li> <strong>Sukhumvit Guide</strong>. A complete listing guide to the hotels, restaurants and bars of Sukhumvit, one of Bangkok's most vibrant districts.\n</li>\n</ul>",
                'image': None,
                'title': 'Publications'
            }, {
                'body': 'Many people go to Bangkok to undergo medical treatments that are a fraction of the cost charged in their home countries. The best-regarded, and most expensive, is <b><a href="http://www.bumrungrad.com/">Bumrungrad Hospital</a></b>, which attracts about 400,000 foreign patients per year or an average of 1,000+ a day. Other hospitals, such as <b><a href="http://www.samitivejhospitals.com/Home/en">Samitivej</a></b> also specialize in serving foreigners. Private hospitals in Thailand are accredited by the government according to international standards, and many of the doctors in Thailand hold international accreditation and relevant licences.\nPopular treatments, ranging from cosmetic, organ transplants and orthopedic treatments to dental and cardiac surgeries, are available much cheaper than in the West. For example, Bumrungrad Hospital charges 90,000 baht for an all-inclusive breast implant package. Bangkok is also known as a centre for <b>sexual reassignment surgery</b> for people wishing to change their physical sex, although this falls out of the scope of a casual trip.\nThere are many dental clinics with English-speaking dentists and staff. The largest of them is the <b><a href="http://www.bangkokdentalcenter.com/">Bangkok International Dental Center</a></b> along Ratchadaphisek Road. There are also plenty of well known teeth whitening, implant and orthodontic providers like <b><a href="http://www.bfcdental.com/">BFC Dental</a></b> and <b><a href="http://www.dentajoy.com/">Denta Joy</a></b>.',
                'image': None,
                'title': 'Medical tourism'
            }, {
                'body': 'The <b><a href="http://www.immigration.go.th">Immigration Bureau</a></b> has moved from central Soi Suan Plu to the far north of Bangkok near the old <a data-object_type="poi" data-id="T__3b6f5a4fc759">Don Mueang Airport</a>. It is a spacious building with a ground floor café, restaurants and copy vendors. Visas, re-entry permits and many other immigration services are available. It is best to take the Skytrain to <a data-object_type="poi" data-id="T__711de99bd900">Mo Chit</a> station and then hail a taxi to the government centre. Services for Burmese, Cambodian and Lao citizens remain at Soi Suan Plu.',
                'image': None,
                'title': 'Immigration office'
            }, {
                'body': '<ul>\n<li> Argentina <strong>Argentina</strong>, Prommitr Villa, 20/85 Sukhumvit Soi 49/1, +66 2 590-4012.</li>\n<li> Australia <strong>Australia</strong>, 37 Sathorn Tai Rd, +66 2 344-6300.</li>\n<li> Austria <strong>Austria</strong>, 14 Soi Nandha, Soi Attakarnprasit, Sathorn Tai Rd, +66 2 303-6057.</li>\n<li> Bangladesh <strong>Bangladesh</strong>, 727 Sukhumvit Soi 55, +66 2 381-1144.</li>\n<li> Belgium <strong>Belgium</strong>, 17F, Sathorn City Tower, 175
Sathorn Tai Rd, +66 2 679-5454.</li>\n<li> Bhutan <strong>Bhutan</strong>, Rm 107, 19F, JTC Bldg, 919 Silom Rd, +66 2 237-3315 .</li>\n<li> Bolivia <strong>Bolivia (Consulate)</strong>, 1901 Ramkhamhaeng Rd, +66 2 314-0040.</li>\n<li> Brazil <strong>Brazil</strong>, 34F, Lumpini Tower, 1168/101 Rama IV Rd, +66 2 679-8567.</li>\n<li> Brunei <strong>Brunei</strong>, 154 Ekkamai Soi 14, Sukhumvit Soi 63, +66 2 381-5914(-6).</li>\n<li> Bulgaria <strong>Bulgaria</strong>, 33/15 Soi Charoen Chai, Sukhumvit Soi 63.</li>\n<li> Cambodia <strong>Cambodia</strong>, 518/4 Pratcha Uthit Rd, +66 2 957-5851(-2).</li>\n<li> Canada <strong>Canada</strong>, 15F, Abdulrahim Place, 990 Rama IV Rd, +66 2 636-0540.</li>\n<li> Chile <strong>Chile</strong>, Unit A, 17F, 193/67 Lake Rajada Office Complex, Ratchadaphisek Rd, +66 2-260-0045.</li>\n<li> China <strong>China</strong>, 57 Ratchadaphisek Rd, +66 2 245-7043.</li>\n<li> Colombia <strong>Colombia (Consulate)</strong>, 9F, Park Place, 231 Sarasin Rd, +66 2 254-5105(-6).</li>\n<li> Croatia <strong>Croatia (Consulate)</strong>, 1F, ITF Silom Palace, 160/347-348 Silom Rd, +66 2 238-5112.</li>\n<li> Cuba <strong>Cuba</strong>, Mela Mansion Apt 3C, 5 Sukhumvit Soi 27, +66 2 665-2803.</li>\n<li> Cyprus <strong>Cyprus (Consulate)</strong>, 17F, Richmond Bldg,
75/59 Sukhumvit Soi 26, +66 2 261-8408(-10).</li>\n<li> the Czech Republic <strong>Czech Republic</strong>, 71/6 Ruam Ruedi Soi 2, +66 2 255-4978.</li>\n<li> Denmark <strong>Denmark</strong>, 10 Sathorn Soi 1, +66 2 343-1100.</li>\n<li> Dominican Republic <strong>Dominican Republic (Consulate)</strong>, 431 Pradit Manutham Rd, +66 2 933-5686.</li>\n<li> East Timor <strong>East Timor</strong>, 7F, <a data-object_type="poi" data-id="T__2b767846f2bc">Thanapoom Tower</a>, 1550 Phetchaburi Rd, +66 2 654-7501(-2).</li>\n<li> Egypt <strong>Egypt</strong>, 49 Soi Ruam Ruedi, +66 2 253-0161.</li>\n<li> Estonia <strong>Estonia (Consulate)</strong>, 62 Soi Yodsuwan, Pracha Uthit Rd, +66 2 690-3779.</li>\n<li> Ethiopia <strong>Ethiopia (Consulate)</strong>, 962/14 Phran Nok Rd, +66 2 411-0218.</li>\n<li> Finland <strong>Finland</strong>, 16F, Amarin Tower, 500 Phloen Chit Rd, +66 2 250-8801.</li>\n<li> France <strong>France</strong>, 35 Charoen Krung Soi 36, +66 2 657-5100.</li>\n<li> Gabon <strong>Gabon (Consulate)</strong>, 13 Pradiphat Soi 10, +66 2 279-2800(-1).</li>\n<li> Gambia <strong>Gambia (Consulate)</strong>, 610/5-6 Song Wat Rd, +66 2 224-0091.</li>\n<li> Germany <strong>Germany</strong>, 9 Sathorn Tai Rd, +66 2 285-6627(-8).</li>\n<li> Greece <strong>Greece</strong>, Unit #25/5-9, 9F, BKI/YWCA Bldg, 25 Sathorn Tai Rd, +66 2 679-1462.</li>\n<li> Honduras <strong>Honduras (Consulate)</strong>, 28F, CP Tower Bldg, 313 Silom Rd, +66 2 641-1567.</li>\n<li> the Vatican City <strong>Holy See</strong>, 217/1 Sathorn Tai Rd, +66 2 233-9109.</li>\n<li> Hungary <strong>Hungary</strong>, 28 Soi Suk Chai, Sukhumvit Soi 42, +66 2 661-1150(-2).</li>\n<li> Iceland <strong>Iceland (Consulate)</strong>, 59 Soi Navin, +66 2 249-1300.</li>\n<li> India <strong>India</strong>, 46 Sukhumvit Soi 23, +66 2 258-0300(-5).</li>\n</ul>\n<ul>\n<li> Indonesia <strong>Indonesia</strong>, 600-602 Phetchaburi Rd, +66 2 252-3135(-40).</li>\n<li> Iran <strong>Iran</strong>, 602 Sukhumvit Rd, +66 2 261-9790(-3).</li>\n<li> Iraq <strong>Iraq</strong>, 47 Pradiphat Rd, +66 2 278-5335(-8).</li>\n<li> Ireland <strong>Ireland (Consulate)</strong>, 208 Wireless Road, 12th Floor, Unit 1201, Lumphini, Pathumwan, +66 2 016 1360.</li>\n<li> Israel <strong>Israel</strong>, 25F, Ocean Tower, 11 Sukhumvit Soi 19, +66 2 260-4854(-9).</li>\n<li> Italy <strong>Italy</strong>, 27F/40F, CRC Tower, 87 Witthayu Rd, +66 2 250-4970.</li>\n<li> Japan <strong>Japan</strong>, 177 Witthayu Rd, +66 2 207-8500.</li>\n<li> Jordan <strong>Jordan (Consulate)</strong>, 47 Sukhumvit Soi 63, +66 2 391-7142.</li>\n<li> Kazakhstan <strong>Kazakhstan</strong>, Ste 4301, 43F, JTC Bldg, 919/501 Silom Rd, +66 2 234-6365(-6).</li>\n</ul> <ul>\n<li> Kenya <strong>Kenya</strong>, 62 <a data-object_type="poi" data-id="Thong_Lo">Thong Lo</a> Soi 5, +66 2 712-5721.</li>\n<li> Kuwait <strong>Kuwait</strong>, 17F, Sathorn Thani Bldg ll, 92/48 Sathorn Nuea Rd, +66 2 354-222(-3).</li>\n<li> Laos <strong>Laos</strong>, 502/1-3 Soi Saha Karn Pramoon, +66 2 539-6667(-8).</li>\n<li> Lebanon <strong>Lebanon</strong>, 15F, CTI Tower, 191/67 Ratchadaphisek Rd, +66 2 261-1013.</li>\n<li> Luxembourg <strong>Luxembourg</strong>, 17F, Q House Lumpini Bldg, 1 Sathorn Tai Rd, +66 2 677-7360.</li>\n<li> Malaysia <strong>Malaysia</strong>, 35 Sathorn Tai Rd, +66 2 629-6800.</li>\n<li> Malta <strong>Malta (Consulate)</strong>, 485/14 Silom Rd, +66 2 235-9423(-4).</li>\n<li> Mexico <strong>Mexico</strong>, 20F, Thai Wah Tower, 21/60-62 Sathorn Tai Rd, +66 2 285-0995.</li>\n<li> Mongolia <strong>Mongolia</strong>, 100/3 Ekkamai Soi 22, +66 2 381-1400.</li>\n<li> Morocco <strong>Morocco</strong>, 12F, Sathorn City Tower, 175 Sathorn Tai Rd, +66 2 679-5604(-6).</li>\n<li> Myanmar <strong>Myanmar</strong>, 132 Sathorn Nuea Rd, +66 2 233-2237.</li>\n<li> Nepal <strong>Nepal</strong>, 189 Sukhumvit Soi 71, +66 2 391-7240.</li>\n<li> the Netherlands <strong>Netherlands</strong>, 15 Soi Ton Son, +66 2 309-5200.</li>\n<li> New Zealand <strong>New Zealand</strong>, 14F, M Thai Tower, All Seasons Place, 87 Witthayu Rd, +66 2 254-2530.</li>\n<li> Nigeria <strong>Nigeria</strong>, 412 Sukhumvit Soi 71, +66 1 711-3076(-8).</li>\n<li> North Korea <strong>North Korea</strong>, 14 Muban Suan Laem Thong Soi 2 (Soi 28), +66 2 319-2989.</li>\n<li> Norway <strong>Norway</strong>, 18F, UBC II Bldg, 591 Sukhumvit Soi 33, +66 2 204-6500.</li>\n<li> Oman <strong>Oman</strong>, 7F, 134/1-2 Silom Rd, +66 2 236-7385.</li>\n<li> Pakistan <strong>Pakistan</strong>, 31 Sukhumvit Soi 3, +66 2 253-0288(-9),.</li>\n<li> Panama <strong>Panama</strong>, 16F, Lumpini Tower Bldg, 1168/37 Rama IV Rd, +66 2 679-7988(-9).</li>\n<li> Peru <strong>Peru</strong>, 16F, Glas Haus Bldg, 1 Sukhumvit Soi 25, +66 2 260-6243.</li>\n<li> the Philippines <strong>Philippines</strong>, 760 Sukhumvit Rd, +66 2 259-0139(-40).</li>\n<li> Poland <strong>Poland</strong>, 25F, Vongvanij Building B, 100/81-82 Rama IX Rd, +66 2 645-0367(-9).</li>\n<li> Portugal <strong>Portugal</strong>, 26 Captain Bush Ln, Charoen Krung Rd, +66 2 234-0372.</li>\n<li> Romania <strong>Romania</strong>, 20/1 Soi Ratchakru, Phahonyothin Soi 5, +66 2 617-1551.</li>\n<li> Russia <strong>Russia</strong>, 78
Sap Rd, +66 2 234-9824.</li>\n<li> Saudi Arabia <strong>Saudi Arabia</strong>, 23-24F, Saeng Thong Thani Bldg, 82 Sathorn Nuea Rd, +66 2 639-2999.</li>\n<li> Singapore <strong>Singapore</strong>, 129 Sathorn Tai Rd, +66 2 286-2111.</li>\n<li> Slovakia <strong>Slovakia</strong>, Pantip Ct, 68 Sathorn Tai Rd, +66 2 285-0220(-2).</li>\n<li> South Africa <strong>South Africa</strong>, Floor 12A, M-Thai Tower, All Seasons Place, 87 Witthayu Rd, +66 2 659-2900.</li>\n<li> South Korea <strong>South Korea</strong>, 23 Thiam Ruam Mit Rd, +66 2 247-7537(-41).</li>\n<li> Spain <strong>Spain</strong>, 23F, Ste 98-99, Lake Rajada Office Complex, 193 Ratchadaphisek Rd, +66 2 661-8284.</li>\n<li> <a data-object_type="poi" data-id="T__83c11cacf1ef">Sri Lanka</a> <strong><a data-object_type="poi" data-id="T__83c11cacf1ef">Sri Lanka</a></strong>, 13F, Ocean Tower 2, 75/6-7 Sukhumvit Soi 19, +66 2 261-1934(-5).</li>\n<li> Sweden <strong>Sweden</strong>, 20F, One Pacific Place, 140 Sukhumvit Rd, +66 2 263 7200.</li>\n<li> Switzerland <strong>Switzerland</strong>, 35 Witthayu Rd, +66 2 674-6900.</li>\n<li> Taiwan <strong>Taiwan</strong>, 20F, <a data-object_type="poi" data-id="W__32004527">Empire Tower</a>, 195 Sathorn Tai Rd, +66 2 670-0200.</li>\n<li> Tanzania <strong>Tanzania</strong>, 3F, S.L.D. Condominium, 501 Sala Daeng Soi 1, +66 2 235-8282(-3).</li>\n<li> Turkey <strong>Turkey</strong>, 61/1 Soi Chat San, Sutthisan Rd, +66 2 274-7262(-3).</li>\n<li> the United Arab Emirates <strong>United Arab Emirates</strong>, 29F, CRC Tower, All Seasons Place, 87/2 Witthayu Rd, +66-2-402-4000.</li>\n<li> the United Kingdom <strong>United Kingdom</strong>, 14 Witthayu Rd, +66 2 305-8333.</li>\n<li> the United States <strong>United States of America</strong>, 95 Witthayu Rd, +66 2 205-4049.</li>\n<li> Uzbekistan <strong>Uzbekistan (Consulate)</strong>, 32 Moo 5, Sukhumvit 62 Soi 1, +66 2 741-7247.</li>\n<li>the Vatican City <strong>Vatican City</strong>, 217/1 Sathorn Tai Rd, +66 2 212-5853.</li>\n<li> Vietnam <strong>Vietnam</strong>, 83/1 Witthayu Rd, +66 2 251-5836(-8).</li>\n</ul>',
                'image': None,
                'title': 'Embassies'
            }, {
                'body': '',
                'image': None,
                'title': 'Go
next'
            }, {
                'body': 'If you want to get out of the city for a while, there are plenty of day trip options from Bangkok.\n\n<ul>\n<li> Amphawa — interesting floating market popular with the locals</li>\n<li> Ayutthaya — ancient capital showcasing its many ruins, 1.5 hours away by bus or train</li>\n<li> Bang Pa-In — its magnificent Summer Palace makes for a pleasant day trip</li>\n<li> Damnoen Saduak — picture-perfect floating market on tourist steroids</li>\n<li> Hua Hin — beach resort town with nearby waterfalls and national parks</li>\n<li> <a data-object_type="location" data-id="Kanchanaburi">Kanchanaburi</a> — the famous Bridge over the River Kwai, the Erawan Falls and Hellfire Pass</li>\n<li> <a data-object_type="tag" data-location_id="Bangkok" data-id="district-ko_kret">Ko Kret</a> — rustic island to the north of Bangkok renowned for pottery making, a pleasant day trip out of the concrete jungle</li>\n<li> <a data-object_type="location" data-id="Nakhon_Pathom">Nakhon Pathom</a> — Thailand\'s oldest city and site of the world\'s largest stupa</li>\n<li> <a data-object_type="location" data-id="Phetchaburi">Phetchaburi</a> — relaxed historic town with the Khao Wang mountain, colourful temples and delicious desserts\n</li>\n</ul>',
                'image': None,
                'title': 'Central Thailand'
            }, {
                'body': 'Bangkok is also an excellent hub for onward travel into other regions of Thailand.\n\n<ul>\n<li> <a data-object_type="location" data-id="Chiang_Mai">Chiang Mai</a> — the gateway to the north and the heart of Lanna culture</li>\n<li> <a data-object_type="location" data-id="Khao_Yai_National_Park">Khao Yai National Park</a> — stunning mountainous scenery and some of Thailand\'s fledgling vineyards</li>\n<li> Ko Chang — large relatively unspoiled tropical island</li>\n<li> <a data-object_type="location" data-id="Ko_Samet">Ko Samet</a> — the closest beach island to Bangkok with white sand beaches</li>\n<li> Krabi Province — the beautiful beaches and islands of <a data-object_type="location" data-id="Ao_Nang">Ao Nang</a>, <a data-object_type="location" data-id="Railay_Beach">Rai Leh</a>, <a data-object_type="location" data-id="Phi_Phi_Islands">Ko Phi Phi</a> and <a data-object_type="location" data-id="Ko_Lanta_District">Ko Lanta</a></li>\n<li> <a data-object_type="location" data-id="Nakhon_Ratchasima">Nakhon Ratchasima</a> — main city in the Isaan region</li>\n<li> Phuket — the original Thai paradise island, now very developed but still with some beautiful beaches</li>\n<li> Sukhothai — the ruins of the ancient Sukhothai Kingdom</li>\n<li> Surat Thani — home of the former Srivijaya Empire, gateway to <a data-object_type="location" data-id="Ko_Samui">Ko Samui</a>, <a data-object_type="location" data-id="Ko_Pha_Ngan">Ko Pha Ngan</a> and <a data-object_type="location" data-id="Ko_Tao">Ko Tao</a></li>\n</ul>\nIf you are considering leaving Thailand there are overland routes to the following destinations:\n<ul>\n<li> Siem Reap - home of the Angkor temples.</li>\n<li> Phnom Penh - capital of Cambodia</li>\n<li> Vientiane - gateway to Laos</li>\n</ul>\n\n\n\n\n\n\n\nDmoz:Regional/Asia/Thailand/Provinces/Bangkok/',
                'image': None,
                'title': 'Further destinations'
            }],
            'title': 'Bangkok'
        },
        'attribution": [{
            "source_id": "triposo_community",
            "url": None
        }, {
            "source_id": "wikivoyage",
            "url": "http://en.wikivoyage.org/wiki/Bangkok"
        }, {
            "source_id": "wikipedia",
            "url": "http://en.wikipedia.org/wiki/Bangkok"
        }, {
            "source_id": "openstreetmap",
            "url": "http://www.openstreetmap.org/node/1628207792"
        }],
        "name": "Bangkok",
        "tags": [{
            "object_score": 9.1662089988828,
            "tag": {
                "tour_count": 7,
                "name": "Day trips",
                "short_name": "Day trips",
                "poi_count": 0,
                "location_id": "Hua_Hin_District",
                "label": "daytrips",
                "snippet": None,
                "score": 1.50402325242855,
                "article_count": 0,
                "type": "do_and_see"
            }
        }, {
            "object_score": 0.0,
            "tag": {
                "tour_count": 0,
                "name": "Part of Thailand",
                "short_name": "Part of Thailand",
                "poi_count": 0,
                "location_id": "Thailand",
                "label": "part_of__Thailand",
                "snippet": "Part of Thailand",
                "score": None,
                "article_count": 0,
                "type": "world"
            }
        }, {
            "object_score": 0.0,
            "tag": {
                "tour_count": 0,
                "name": "Cities",
                "short_name": "Cities",
                "poi_count": 0,
                "location_id": None,
                "label": "city",
                "snippet": "Cities",
                "score": None,
                "article_count": 0,
                "type": "world"
            }
        }, {
            "object_score": 0.0,
            "tag": {
                "tour_count": 0,
                "name": "Part of Central Thailand",
                "short_name": "Part of Central Thailand",
                "poi_count": 0,
                "location_id": "wv__Central_Thailand",
                "label": "part_of__wv__Central_Thailand",
                "snippet": "Part of Central Thailand",
                "score": None,
                "article_count": 0,
                "type": "world"
            }
        }],
        "type": "city",
        "country_id": "Thailand",
        "coordinates": {
            "latitude": 13.7465263,
            "longitude": 100.534763
        },
        "id": "Bangkok",
        "snippet": "Thailand"s largest city by far, a sprawling metropolis of wealth, squalor, culture, and sin.",
        "parent_id": "wv__Central_Thailand",
        "intro": "Thailand"s largest city by far, a sprawling metropolis of wealth, squalor, culture, and sin.",
        "images": [{
            "attribution": {
                "license_link": "http://creativecommons.org/licenses/by-sa/2.0/",
                "attribution_link": "http://www.flickr.com/photos/jmhullot",
                "attribution_text": "Jean-Marie Hullot",
                "license_text": "CC BY-SA 2.0",
                "format": "{attribution} / {license}"
            },
            "license": "CC BY-SA 2.0",
            "sizes": {
                "medium": {
                    "url": "http://api-images-www.triposo.com/03/gAAAAABbQk2pj_RVkuUmy_mo6ReQIDDeTJvByDtx1PIySsyoCAD8mK_2U4YeEzZvg8M9WE7uhNhPRyuJbtbXU_4sCaKK0ZX24V-2qkB6foBC1kNDOlmg3l0hMvI1uxUMcSiTgye1UhsrskInS3G-1XHnSNOW1Xo3kqF3yqczWaPSG8tCzo_xWDK53l4yf5TmXsxudRztC19c1q_tTQRdfdK2uDZoWdCFqQ==",
                    "width": 640,
                    "bytes": 21489,
                    "height": 425
                },
                "thumbnail": {
                    "url": "http://api-images-www.triposo.com/03/gAAAAABbQk2pWf-emad1FPApNBDtVr_e6S3j5MbyU2xlbFan1r6WwTjuP1equq_yFBLD7o2zneDqTnH1M8kcGp6tbAcT4Bi29C0cgpOeByxBCuMH8DN8Va9tWm_-36i3W5PUYp963x3InSLhBVZ6r0-mzSbhh-qrcgVS-kTmoOv01zgENn7Hhg33kQCqEmjui20ZCPTjrooW5oU9sNVDNiIWuJMtPHrTvg==",
                    "width": 192,
                    "bytes": 3826,
                    "height": 127
                },
                "original": {
                    "url": "https://farm3.staticflickr.com/2153/2068022450_b6c62f89a3_o.jpg",
                    "width": 800,
                    "bytes": 138901,
                    "height": 532
                }
            },
            "owner": "Jean-Marie Hullot",
            "source_url": "https://farm3.staticflickr.com/2153/2068022450_b6c62f89a3_o.jpg",
            "caption": None,
            "source_id": "flickr",
            "owner_url": "http://www.flickr.com/photos/jmhullot"
        }, {
            "attribution": {
                "license_link": "http://creativecommons.org/licenses/by-sa/2.0",
                "attribution_link": "https://commons.wikimedia.org/wiki/File:Grand_Palace_in_Bangkok.jpg",
                "attribution_text": "echiner1",
                "license_text": "CC
BY-SA 2.0",
                "format": "{attribution} / {license}"
            },
            "license": "CC BY-SA 2.0",
            "sizes": {
                "medium": {
                    "url": "http://api-images-www.triposo.com/03/gAAAAABbQk2pkQK6AKtyIZWGZF7QOkoKGZGBwd-ofytE5sd7o6bGY13toQk31zKCnyrdxZeki09R4KBeg5wjb34YcqawfPgM6YpLXbS2YEys3A-18vMe7FDHlub7llwni19aTlb450D9xfTLxma2GxOEtRTY2sCGSxdxIm0Uy9DxKR2ZbsJXEmS0pvNPYbh4WmAj3TpuGxHTyJwRVSzN0BYSDn3gDr14ZJznt58_ZfUYjq9ViVcd4pA=",
                    "width": 640,
                    "bytes": 54678,
                    "height": 426
                },
                "thumbnail": {
                    "url": "http://api-images-www.triposo.com/03/gAAAAABbQk2pFO6Tb0EHcKgT62EiH0vNZtGXbv24uNe5RBZjnHWpbUibpumpyuwOlC2uANLnqUR_Yr90VXgXk2omNAdca8SWl2LApJoZQE1QXHN8c7wEOT03wc_rsFkTbjh0eOeqNWVFJRYFvmMTRP3lWecOmGZc2r0vUPsZMeW-j6Uqc5SICLGK8nPCg0ih6CCA-d_Qve8KYVMPE6JmHrLJDcHBrG6U0xonufeU-KnZMCVVVsS4L6g=",
                    "width": 192,
                    "bytes": 8423,
                    "height": 128
                },
                "original": {
                    "url": "https://upload.wikimedia.org/wikipedia/commons/9/93/Grand_Palace_in_Bangkok.jpg",
                    "width": 1024,
                    "bytes": 497870,
                    "height": 683
                }
            },
            "owner": "echiner1",
            "source_url": "https://upload.wikimedia.org/wikipedia/commons/9/93/Grand_Palace_in_Bangkok.jpg",
            "caption": "Chakri Maha Prasat Hall, Grand Palace",
            "source_id": "wikivoyage",
            "owner_url": "https://commons.wikimedia.org/wiki/File:Grand_Palace_in_Bangkok.jpg"
        }, {
            "attribution": {
                "license_link": "http://creativecommons.org/licenses/by/2.0",
                "attribution_link": "https://commons.wikimedia.org/wiki/File:BTS_Thong_Lo_Station.jpg",
                "attribution_text": "Andy & Anna Kelk",
                "license_text": "CC BY 2.0",
                "format": "{attribution} / {license}"
            },
            "license": "CC BY 2.0",
            "sizes": {
                "medium": {
                    "url": "http://api-images-www.triposo.com/03/gAAAAABbQk2pBy4Hin9pnW_d3sYyhvlPPbe85qIouAVTO9wdGrRt0egEQT8L1WHHz6s6-2KB2lITctRny3hjC9hroWShB2paCYqDHpIOdshc4Hvm9IZX2NefOP-27fIhOHVjuaVjoTp2wokbQ79KM-jtHG1r9pioFGVL-dKXlfUgi2jps2ww8vk62GkYwfMGg7wzY-DWTy5DTeJ3WhG299RhEzKOWZxgyf4bKJUWzRPcKZyNxz1Eqec=",
                    "width": 640,
                    "bytes": 44728,
                    "height": 483
                },
                "thumbnail": {
                    "url": "http://api-images-www.triposo.com/03/gAAAAABbQk2p3aaeOlckE9qYrvhvUfiZs0WAU4E8zC2kWgkNHdKjysAJ2J6_aB9tJVkVrbooT0cm9MX9iEyaiyE4RPnBPZBDG8BkWfS7bmXNcYfeDAFpJyMGA_rKPg_e7qFXU6apjg2V1UEqfocMRrj1NWwBM5RHUIo1Pkhq3AWWy9PkTFIJgGmAHlS_iFmXdK5MxpMUKgdjhMi7rwTJDFyizsb5Gq5Rkk4a8qDPVmPjCyLyd0TF6TE=",
                    "width": 192,
                    "bytes": 7465,
                    "height": 144
                },
                "original": {
                    "url": "https://upload.wikimedia.org/wikipedia/commons/f/f1/BTS_Thong_Lo_Station.jpg",
                    "width": 1632,
                    "bytes": 807058,
                    "height": 1232
                }
            },
            "owner": "Andy & Anna Kelk",
            "source_url": "https://upload.wikimedia.org/wikipedia/commons/f/f1/BTS_Thong_Lo_Station.jpg",
            "caption": "Skytrain of Bangkok near Thong Lo station",
            "source_id": "wikivoyage",
            "owner_url": "https://commons.wikimedia.org/wiki/File:BTS_Thong_Lo_Station.jpg"
        }, {
                "license_link": "http://creativecommons.org/licenses/by/2.0/at/deed.en",
                "attribution_link": "https://commons.wikimedia.org/wiki/File:Loy_Krathong_Bangkok_Lumpini_Park_2.jpg",
                "attribution_text": "Robertpollai",
                "license_text": "CC BY 2.0 at",
                "format": "{attribution} / {license}"
            },
            "license": "CC BY 2.0 at",
            "sizes": {
                "medium": {
                    "url": "http://api-images-www.triposo.com/03/gAAAAABbQk2pPTmebi6QJt0a0zOYIXYDUioNtAJ3Gq1KaP2yuLINOxVvmmTwfbF0wY8SvMsbwJw0jN8U9RQYn6ttLR-Bs3rwyf3uxuhe2BLO1iCSSU76f7nR11bpvzrP-xr3rPK9QLwJu0xfh8totV7gu3sPKfo3-Rp7tKNnzgEC89olyZdS97x5i1YsC84UF4wbYXkp8NucBc2RKkTD8KdfJHcZ6IqvsQlUwTxsgan8_afR_pUQvUs=",
                    "width": 640,
                    "bytes": 10207,
                    "height": 426
                },
                "thumbnail": {
                    "url": "http://api-images-www.triposo.com/03/gAAAAABbQk2p95RX9axjR8FPNIa4z5Ia73CZsznOwyNCAVivZ_sXwOWurtIIiLikEoHEv0S2gD2dC-aYS1TtSEuwyU0EBSWvfFKPClOIHuj5LDCTFOU3yMEbKqFVa3rjZX2a5WOmG5XYgcGv59V7o1EJg4_mGqAulm29hikpWyIZ2LWM3se_LtTkGu8XPQh-em7iwy-6JxRE9-vu0FbDh6fadqWuL4s53cXSGnCP3FSE25SMiUTNxT4=",
                    "width": 192,
                    "bytes": 2557,
                    "height": 128
                },
                "original": {
                    "url": "https://upload.wikimedia.org/wikipedia/commons/1/14/Loy_Krathong_Bangkok_Lumpini_Park_2.jpg",
                    "width": 3504,
                    "bytes": 1277517,
                    "height": 2336
                }
            },
            "owner": "Robertpollai",
            "source_url": "https://upload.wikimedia.org/wikipedia/commons/1/14/Loy_Krathong_Bangkok_Lumpini_Park_2.jpg",
            "caption": "Launching a krathong down a pond",
            "source_id": "wikivoyage",
            "owner_url": "https://commons.wikimedia.org/wiki/File:Loy_Krathong_Bangkok_Lumpini_Park_2.jpg"
        }, {
            "attribution": {
                "license_link": "http://creativecommons.org/licenses/by/3.0",
                "attribution_link": "https://commons.wikimedia.org/wiki/File:Thaimassage.jpg",
                "attribution_text": "Bhattharasinthorn Kosawan & Chot-Anan Kittiraweechot",
                "license_text": "CC BY 3.0",
                "format": "{attribution} / {license}'
            },
            'license': 'CC BY 3.0',
            'sizes': {
                'medium': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pC-tWPtpVrpjFciVDAfljCTs2UsjGBxZqNX70b3_KF1bOoxhMH6xCANE74vXCGsDuIITUa32yqYQYPmlRhZ5zi8R50Byurb4tSuRNWYARRXCKq0zUBmPew4-eYIeNA2K2yh9BfoVAIzmgTLnN2GNyesmKsUCSKVb3zFVDsnrBgqfiAmsXbBhu05mAeDNaqRU2Wfm0U7s1DideLlBKjZtzrqCz7R0XD4wLgx-jOwFaF2Y=',
                    'width': 600,
                    'bytes': 41185,
                    'height': 450
                },
                'thumbnail': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pdsC-_ZT-a-38QcWLG4hrBBblG1z5DqsLJrnQpwJ7jAtcmW882CSqhh4sPE8pDHv49DuuYRMGmJlfMU_jj-Wr6pwZxY1C3rzphS2NssYIgIAgHgXtJjEsGO88GPoIzStXXTXabQ4ifN1BkfhmkCwR3rISR61A16xbO22S5QYK0wIW458gyM1VdXj-W2u58bKq3FIs6LA6rQBt8WIOejqfN_O3OBk4yoqYt8s3fB7syOY=',
                    'width': 192,
                    'bytes': 8196,
                    'height': 144
                },
                'original': {
                    'url': 'https://upload.wikimedia.org/wikipedia/commons/0/0c/Thaimassage.jpg',
                    'width': 600,
                    'bytes': 113625,
                    'height': 450
                }
            },
            'owner': 'Bhattharasinthorn Kosawan & Chot-Anan Kittiraweechot',
            'source_url': 'https://upload.wikimedia.org/wikipedia/commons/0/0c/Thaimassage.jpg',
            'caption': 'Thai massage in Bangkok',
            'source_id': 'wikivoyage',
            'owner_url': 'https://commons.wikimedia.org/wiki/File:Thaimassage.jpg'
        }, {
            'attribution': {
                'license_link': 'http://creativecommons.org/licenses/by/2.0',
                'attribution_link': 'https://commons.wikimedia.org/wiki/File:Bangkok_Sirocco.jpg',
                'attribution_text': 'Tumitu Design',
                'license_text': 'CC BY 2.0',
                'format': '{attribution} / {license}'
            },
            'license': 'CC BY 2.0',
            'sizes': {
                'medium': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pzSkyJJIjQGdDKAtfiVviWJcJOStrxlidJpKnk9l5l-cbme8q2noktFUARXsvujPlPZMtzoEj05JSnhC1u21XKS55OmQNB9DGurgeiKvh3C2MHUK1QZxc2Z_5LMs1vYDWriuXp4RNHtLbksuEx-vtLCbUDPKucyEOB-N9n5sEScDXZbhVb-uOUp6KWsyy-mY5q7_OxPkQYwGFy5yQG1GZHpbuQ_q-MMnh0-Mlylx1egc=',
                    'width': 480,
                    'bytes': 38016,
                    'height': 640
                },
                'thumbnail': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pWeXN9YcRTWASlanS871gXD5lXE2gpI1dMsK4ME76hc5ZaMm6ncvo4peLv5Q73gyghOUdQMGbdGquUP51QfyC42J6FRitam_D7QIl39Z3P2xrpNjJMHmdUGPa-0ziwkvUALrVAGNxeHCFNLA-si7fwRgddNXOWdFFgt9S3S4ACgpC2wXnNrFEhyeFBTytNmR2f_1hKwBYHZeSKcyjd4ZitwfHPcupeYt3zYUf_0n5lsE=',
                    'width': 144,
                    'bytes': 7264,
                    'height': 192
                },
                'original': {
                    'url': 'https://upload.wikimedia.org/wikipedia/commons/1/16/Bangkok_Sirocco.jpg',
                    'width': 1200,
                    'bytes': 808639,
                    'height': 1600
                }
            },
            'owner': 'Tumitu Design',
            'source_url': 'https://upload.wikimedia.org/wikipedia/commons/1/16/Bangkok_Sirocco.jpg',
            'caption': 'Sirocco at State Tower, Silom',
            'source_id': 'wikivoyage',
            'owner_url': 'https://commons.wikimedia.org/wiki/File:Bangkok_Sirocco.jpg'
        }, {
            'attribution': {
                'license_link': 'http://creativecommons.org/licenses/by/2.0',
                'attribution_link': 'https://commons.wikimedia.org/wiki/File:Tuktuks_in_Bangkok.jpg',
                'attribution_text': 'HellonEarth2006 from Oldham, Lancashire, United Kingdom',
                'license_text': 'CC BY 2.0',
                'format': '{attribution} / {license}'
            },
            'license': 'CC BY 2.0',
            'sizes': {
                'medium': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pWHy8y4SscdI_gETcaUnxN4lbGKX19NBQc98kKq-v5lvRiJGvkJgUOZIbSBO9fLw5VomAoDuS-K4lX84kQdUIWGb5ys9WvJ8nFWmDE20HphN5hQD3mzOr5_wJZbzuPBgZgbl8XQIdc5aRwh2X-z6FuEJrnGLBJ9uPdmwm-XiM-ZXGnra9iyfM1uYQwVCO-v2XOCfQCJ33GWlJ3IPTewbk6dYk6NGxoccL3EPsGI5i4aI=',
                    'width': 426,
                    'bytes': 61490,
                    'height': 640
                },
                'thumbnail': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2p7PGqGdOrY9QibFG5LdKL5PicvWNfmCMdKqPwhvYxjPKhkMxtCkyuEHh_f8hi2TTiIDIBlNgfyXAKuU-odjP9U0Dx-cZSJpx3KIZphfv87mv7nE8feE7HmuLA4OapIbHveBCqiJKuJCDkGk3JsTobTff3ezk_p8JI2GYb4jc2A7433UGhMPtj0NVVkHK_v6R_jIaweMAIQkijPz-RPGeoY3UwzGJjygiCJyqA_umOjiU=',
                    'width': 128,
                    'bytes': 9922,
                    'height': 192
                },
                'original': {
                    'url': 'https://upload.wikimedia.org/wikipedia/commons/e/e7/Tuktuks_in_Bangkok.jpg',
                    'width': 1288,
                    'bytes': 2792197,
                    'height': 1936
                }
            },
            'owner': 'HellonEarth2006 from Oldham, Lancashire, United Kingdom',
            'source_url': 'https://upload.wikimedia.org/wikipedia/commons/e/e7/Tuktuks_in_Bangkok.jpg',
            'caption': 'Tuk-tuks in Bangkok',
            'source_id': 'wikivoyage',
            'owner_url': 'https://commons.wikimedia.org/wiki/File:Tuktuks_in_Bangkok.jpg'
        }, {
            'attribution': {
                'license_link': 'http://creativecommons.org/licenses/by-sa/3.0',
                'attribution_link': 'https://commons.wikimedia.org/wiki/File:Yaowarat_Road_in_Samphanthawong_District,_Bangkok,_Thailand.jpg',
                'attribution_text': 'User: (WT-shared) Globe-trotter at wts wikivoyage',
                'license_text': 'CC BY-SA 3.0',
                'format': '{attribution} / {license}'
            },
            'license': 'CC BY-SA 3.0',
            'sizes': {
                'medium': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pAi4FzUC4nfY0jP7vsZ60Vc_eNl97ofpCpcNYTt3sT_pA6lsV5QiPpV9GjrgfiZ4cihFJ-bWgtnl4-ITqp8lwT6GTN9iXvUXVeKlyQ9x8H6HSEzrN8KlqsqVkIMpOWVP1jnj2j1y48pLNFUib-lJMxqTpgPHzWUcCDhiCWBk7c9In7masQ9DhhI1AuTjpwpMcDZqtg1kdb8rEffbYNX36S0jOQubCyLCwvnHCErkYozQ=',
                    'width': 640,
                    'bytes': 63039,
                    'height': 480
                },
                'thumbnail': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pvJv_eQMFQJUS7lAfVTk4h-4FB1riwtEvyHpXy4bM1mdtDiW-npubNX8e8aDLiNZBpcjeGMwExxMqy-SjmVFc-xuOX_QJwDFhajCw-RBgEOmf1GLL_uKQesSfzQbhdcexYgbUF5gXZZTs5lEEZM8Rzb-h7BBAuL25BQjbHWDV6dSRWf059CkKOMCKQ9c83xRPeWVhgP61sChG5LKLexnVMeXMbe3zleDzXVVTaxHtujg=',
                    'width': 192,
                    'bytes': 9685,
                    'height': 144
                },
                'original': {
                    'url': 'https://upload.wikimedia.org/wikipedia/commons/4/48/Yaowarat_Road_in_Samphanthawong_District%2C_Bangkok%2C_Thailand.jpg',
                    'width': 2592,
                    'bytes': 2081068,
                    'height': 1944
                }
            },
            'owner': 'User: (WT-shared) Globe-trotter at wts wikivoyage',
            'source_url': 'https://upload.wikimedia.org/wikipedia/commons/4/48/Yaowarat_Road_in_Samphanthawong_District%2C_Bangkok%2C_Thailand.jpg',
            'caption': 'Yaowarat Road',
            'source_id': 'wikivoyage',
            'owner_url': 'https://commons.wikimedia.org/wiki/File:Yaowarat_Road_in_Samphanthawong_District,_Bangkok,_Thailand.jpg'
        }, {
            'attribution': {
                'license_link': 'http://creativecommons.org/licenses/by-sa/3.0',
                'attribution_link': 'https://commons.wikimedia.org/wiki/File:Crocodile_in_a_pond_in_Wat_Chakrawat,_Samphanthawong_District,_Bangkok,_Thailand.jpg',
                'attribution_text': 'User: (WT-shared) Globe-trotter at wts wikivoyage',
                'license_text': 'CC BY-SA 3.0',
                'format': '{attribution} / {license}'
            },
            'license': 'CC BY-SA 3.0',
            'sizes': {
                'medium': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2p4fmFtEpLjbWTxP4X53dVdyDkYxnlmiWlU8iRSWvaw0Gh3SM1g1lQPe8tGMjKtAvlYK7G2HINh6ev3-vmlEUn54iEh8tiBNYdk5i960Ib8wLTZid5j8t1GLKj2na01H7peXtpOnlWCG5Q1AaoK0rlrmYe7Es6NSEqWDAFXUQKxy818wHfNdD1RC-1GwIKXFDW1tVCqdTnHkOUwFgZPmSFgHfQp8sez1TDcUpjpQTGIHw=',
                    'width': 640,
                    'bytes': 79893,
                    'height': 480
                },
                'thumbnail': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pTN613C_XdjGUEyEqBgv9YUDLoWa_kiEb_D960tHa6LvL68Rqk8Ao1omSjba923BTUVRvgXNKDDZsTwg2tV_NKNOo_rwY6NRGtpNPe81r5b_Wh99TMUCsW6g3SvgZm551KqXXuc3uOr-cQQ8K7VP66g6Z39K0A2UxEyF5gp1UUG-H-_3yaad30ywcps-S9La_g8C_TUL9-swQD4kZVQm2HXa-41hW_sSAhJ2AxjCbWgs=',
                    'width': 192,
                    'bytes': 10251,
                    'height': 144
                },
                'original': {
                    'url': 'https://upload.wikimedia.org/wikipedia/commons/7/77/Crocodile_in_a_pond_in_Wat_Chakrawat%2C_Samphanthawong_District%2C_Bangkok%2C_Thailand.jpg',
                    'width': 1600,
                    'bytes': 1502726,
                    'height': 1200
                }
            },
            'owner': 'User: (WT-shared) Globe-trotter at wts wikivoyage',
            'source_url': 'https://upload.wikimedia.org/wikipedia/commons/7/77/Crocodile_in_a_pond_in_Wat_Chakrawat%2C_Samphanthawong_District%2C_Bangkok%2C_Thailand.jpg',
            'caption': 'Crocodile at Wat Chakrawat',
            'source_id': 'wikivoyage',
            'owner_url': 'https://commons.wikimedia.org/wiki/File:Crocodile_in_a_pond_in_Wat_Chakrawat,_Samphanthawong_District,_Bangkok,_Thailand.jpg'
        }, {
            'attribution': {
                'license_link': None,
                'attribution_link': 'https://commons.wikimedia.org/wiki/File:Leng_buai_ia_shrine.jpg',
                'attribution_text': 'Alan Oscroft User:Boing! said Zebedee',
                'license_text': 'Public domain',
                'format': '{attribution} / {license}'
            },
            'license': 'Public domain',
            'sizes': {
                'medium': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2p3xUD_37Jqthp1xwrNCtvQf6O-dYMHp_skFsnVteinreBPlZlCA8PBwF59cjkBKECu4ZjqddHEFPV4yqjGjj21OYBAVA5vGAfgW9mroxzWXS0mQO09TOut21LV_XTkMIkBuDDi1XoxilCia16quJ02TIwr_AMnpnwlkJUx0Qu8mP1I37Jxyf2tGyvN7kPD3gGW5iSMAiR9ca6_MoIlq3C9eXObCFTEuM3OovA9LaOkYk=',
                    'width': 640,
                    'bytes': 70899,
                    'height': 423
                },
                'thumbnail': {
                    'url': 'http://api-images-www.triposo.com/03/gAAAAABbQk2pRSPGbcCzgAhtKZNFS8S-3v7xCeMlAz8w9iCQvBh3hc1I4T43hUgjyPTPEtR9mVp2Y1NbxvaD02c3xKX5eLtVFtMj2K_HvxprLgB_CS1CZnnbxZiqI-RLkSQLNX98oVfo1FRbdhBuU9UPqaxotocM83TVWj3RG1AVLuXBFd23ByfYNJbxE98-C3dIN1dTCRkxnCyiIsLmUUYWFSSpnq-H3DpPFP2KOiOT5IVODENb81U=',
                    'width': 192,
                    'bytes': 9193,
                    'height': 127
                },
                'original': {
                    'url': 'https://upload.wikimedia.org/wikipedia/commons/a/ad/Leng_buai_ia_shrine.jpg',
                    'width': 2048,
                    'bytes': 1575730,
                    'height': 1356
                }
            },
            'owner': 'Alan Oscroft User:Boing! said Zebedee',
            'source_url': 'https://upload.wikimedia.org/wikipedia/commons/a/ad/Leng_buai_ia_shrine.jpg',
            'caption': 'Leng Buai Ia Shrine',
            'source_id': 'wikivoyage',
            'owner_url': 'https://commons.wikimedia.org/wiki/File:Leng_buai_ia_shrine.jpg'
        }],
        'score': 10.9317707546528,
        'tag_labels': ['city', 'daytrips', 'part_of__Thailand', 'part_of__wv__Central_Thailand'],
        'properties': [{
            'value': '8280925',
            'name': 'Population',
            'key': 'population'
        }]
    }],
    'estimated_total': 1,
    'more': False
}